{"https://www.zomato.com/bangalore/biergarten-whitefield": {"name": "Biergarten", "location": [12.9824459531, 77.708532773], "reviews": ["Ambiance and food was good!! Went for team party!! Ordered veg and nonveg platter!! I ordered watermelon basil lemonade.. and had few veg snacks!!", "I always recall this place for their good portion of appetizers. Combined with the happy hour menu, it's a good place to be in.  Loved the pork belly and the sausages. It's unfair to rate this place  as 3 but not fair to rate 4 as well. For me it's a 3.7ish not because I didn't like the place but because I've been to better ones. I do recommend visiting here for a nice evening spent.", "\"Aptly Named\"", "Amazing place!! Loved the ambiance nd the food was great too!!", "Great food and drinks. Must visit. Service is good. Nice ambiance, so go and relax with beer. Wheat beer is best. Cocktails were good too. Ordered few non-veg dishes, chicken and prawns, all were delicious. Place is crowded on weekdays too. Overall nice experience.", "Biergarten is one of our favourite place to hangout with friends.", "Nice ambience. Very friendly and courteous staff. Loved it! The food is really awesome. Especially the pizzas and the chilli chicken.", "Had really high expectations from this place but it wasn't up to the mark for me. The beer was decent but the place needs to be maintained better. Also, I went in an afternoon so they had buffet and had nothing else but French fries for a la carte, which was bizarre if you are the just for some drinks and snacks.", "Liked this place.it has this nice ambience..dint like the spring roll much.cheese garlic bread was nice too..sangria was jus okay.ambience is pretty gud here", "Great place to have beer and thier wheat beer is must try."], "rating": "4.5/5"}, "https://www.zomato.com/bangalore/high-ultra-lounge-malleshwaram": {"name": "High Ultra Lounge", "location": [13.0116628688, 77.5551379099], "reviews": ["Ambiance is just wow!", "Its highly rated. i went for date night expecting certain things, but did not match up my expectations. For the location they have better interiors could work wonders. Food is okayish not like so great. I tried Thai which is difficult to replicate in most part on Bangalore, it was okay too. Dont expect too much but do visit.", "I have visited this place for the first time on 26th May after so many missed plans. It has a very limited seating area and was almost fully occupied by the time we reached the place at 0820PM. (We made reservation for 8pm but could reach only by 820pm.)Hence we had to wait close to 10 minutes for the table. We got 2 high seats with a very small round table which was way too congested given the smallness of the table. At a time it can hardly accommodate more than 3 small plates. Given that there was no other place to occupy we took it. We ordered spicy cottage cheese and thai noodles. While the quantity of former is decent and tasted good, the latter tasted horrible although the portion wass huge. We couldn't complete the noodles and we have left more than 3/4th portion.We had 4 beers(heinken) which costed 1800 which is too high for the kind of ambience and seating they provided. The service was super quick, with sever getting us main course first and starter later!!.We asked him to get starter first.Now this is what is not expected of a restaurant which claims to be a Premier one. It was a techno music night which really didn't help the mood. We are not into techno may be because of that but it was a great spoiler for a nice evening. After sometime we asked for a different seating closer to the edge with a great city view. Well the view is astounding. One has to visit this for the views only. All in all it was not as great as we expected. The food choice given were too less for veggies like us. After the food items were served it was almost impossible to get hold of anyone for next order.", "If we talk about the location, this place is definitely 5* - view of bangalore city from this is quite impressive. Food quality is great at this place.", "I had heard a lot about the view from this place and I was not disappointed. Went there on a date and was blown away by the breathtaking view it offers. As the lift drops you, you make your way one more floor via the stars through an allay of red and dimly lit passage until the restaurant comes into view.", "The best part about this place is the view since it is on the 30th floor. The decent part was ambience and the service. But coming to food, it was disappointing as I had high expectations. Couple of items tasted well but a few didn't.", "I heard of this place as one of the most romantic and good place to have food in Bangalore, It is the highest dining venue of South India currently. So 5 days before I went for celebration here on Monday evening with my partner. And believe me from entry of the gate to the seat also gave us the great feel. And the view you get by sitting on high chair from 421 feet high is amazing. No words for that. You see fast moving Bengaluru from there with metro running in front of us. In night the of Bengaluru from that height is just amazing.", "Burnt food is inexcusable other than one poor waitress running the entire floor while 3men in suits just watch. It rook them 30mins to get us the menu to the table. Other than frustratingly loud music and horribly tasting food. They actually were shameless enough to charge us for this I bout guests nd you let me down will never come back", "I went on a weekday. I expected it to be really awesome experience but it wasn't though it was really nice. Food service and ambience were good. It's worth visiting and can go multiple times as well.", "Most amazing view of bangalore city you can get ever."], "rating": "4.1/5"}, "https://www.zomato.com/bangalore/vapour-pub-brewery-indiranagar": {"name": "Vapour Pub & Brewery", "location": [12.9692175973, 77.6411483064], "reviews": ["Vapour -Vapour will definitely vaporized you by the good music, amazing beers & good food. Visited this place on Thursday & Friday. These two days tells you the two different story altogether, while on Thursday, it was chilled kinda environment, while on Friday, the place turns into dance floor aka party place with amazing DJ.", "This is my 2nd visit to this place. This time went for brewery. Ordered few drinks and fried corn and chicken tikka both were tasty. Drinks were good.", "We had just finished our office wanted a place to go ..", "Vapour is the most happening pubs of Bangalore ..situated in the heart of indiranagar (100ft road) it is the perfect place to find solace in Bangalore", "Went there on a Saturday night,the crowd was super chill and enjoying the match.", "IPL Finale CSKvsSRH, i was confused and wanted to enjoy the finale in big projector in a cool pub with a great ambience. Checked with few friends and One of my friends suggested Vapour and we planned accordingly.", "Was meeting a friend after a long time and wanted a place where we can sit and chill for long hours.. and this is the best place for it..roof top pub n brewery with a large screen to play the sports event.. food is good ..with respect to quantity and taste..service is quite fine and they allow you to sit and chill till your order arrives..a good place and should be visited !!", "Really disappointed with the service here. All the waiters are standing idle. But had to ask 4 times for water and multiple times for other orders. It's not even too busy. Its not even fully occupied but still they are not able to service. After so many reminders they even got the orders wrong.", "Fantastic beer. Could not get a chance to taste anything on the menu but the beer were on point. Birthday well spent thanks to their lovely beer.", "The food was average, and the vapour premium beer was amazing, I don't know why do they have to impose the service charge on the total bill, even though it's not mandatory, I will recommend this place if you love beer and a good ambience !"], "rating": "3.9/5"}, "https://www.zomato.com/bangalore/the-globe-grub-marathahalli": {"name": "The Globe Grub", "location": [12.9512213434, 77.6993042976], "reviews": ["The ambience is amazing. The staff is also very nice. The starters are really very very tasty! I loved their crispy corn. They have pizzas, momos, pasta, gol gappas, Chaat, amazing range of starters including tandoori soyabean, pineapple, potato Chaat, Tandoori Paneer. They also have a nice range of North Indian dishes & breads. The desserts are also really good.", "An All vegetarian food review....", "Service is the best. We never had to ask the bearer to refill and we didn't even wait for food. It was that perfect and best service I felt. Mojitos are okay. But overall food is pretty good and tasty.", "Situated in the prime marathalli-sarjapur road, in the mist of many tech parks this place offers the global multi cuisine buffet experience.One fine weekend I decided to give it a try.Had high hopes from this place since it is considered one of the finest buffet restaurant in bangalore.", "Definitely not worth 4.5 rating. Ambience was the only great part. Food was very average. Prawns served were frozen ones, not at all fresh. Service was good.", "The food here was too good...the places seems to be well known for team lunch and all..the ambience was nice...the service by  was appriciable...The taste is mild and I loved the mashroom cheese pakoda and prawns in non veg...worth for the money restaurant", "A veg foodie here 😛", "Taste is good. Varieties also good. But all starters need to be cooked little bit. So many deserts. Mutton curry is very good in main course rara mutton. Over all its good.", "Food is good with lots of varietyin both veg and non veg , courteous staff . Would like to mention name of Debashish who was really helpful. Would visit again .", "Food taste 4"], "rating": "4.5/5"}, "https://www.zomato.com/bangalore/empire-restaurant-koramangala-5th-block": {"name": "Empire Restaurant", "location": [12.9348821453, 77.6159456], "reviews": ["An authentic place of good food And ambience.", "They always have decent food and service. But this Saturday night, considering the usual huge rush, the service was quite slow and waiters were ignorant. Also, we asked for a faluda for a single person which 3 person would share they ended up getting a huge bowl worth 799, which was one of the worst faludas I've tasted after paying an exorbitant rate for it.", "Good food. Nice ambiance. We went during the time of ramadan and there were stalls lined up after 6.45pm. Must try camel seekh kebabs! Also.. Karama restaurant is situated just above Empire which serve authentic karachi cuisine.", "If you love non veg food with a Southern side cooking  style you will absolutely love this place. ..chicken dosa is the best thing to try over here absolutely lip smacking. ..if you are ok with coconut based stew do try semiya chicken. ..reminded me of my college days..overall food coma for non veg lovers ...do give it a try.", "Food - 4.0", "Whenever I come to Empire I get reminded of foodin restaurant of Bombay. The foods is very similar. They have a great range of kebab and tandoor items, which fits perfectly with my keto diet. One of the few restaurants that will feed hungry souls even at 1 or 2 in the night. So definitely a good place to just come and hog. It's the mindless comedy of cuisine. Just gorge on food and go home.", "I have never seen a more lost set of servers anywhere else. I literally had to wave my hand in the air in all directions to get somebody’s attention. No kidding.", "They forgot the order that we had placed and order for Arabian pulpy grape juice. When asked one attendant said that it is not available. After some time on their own he gets the grape juice (not pulpy one) without our confirmation. He then says he cannot cancel the order. When I strongly said I am not having what I did not order, he goes and talks to few people and then gets a jug of the Arabian pulpy grape juice. Not sure where dud it appear magically from. FYI, I had ordered for 2 glasses of juice and not a jug. I was frustrated at the end n just paid n left.", "Empire is a place for who loves Briyani and also for freaky non-vegetarian!!", "To be very honest, i went to this place many times expecting that at least something will be good, nope! Anything you order be ready to get disappointed. Food is never upto the mark be a from a normal paneer ki sabji to biryani, gravy items are tasteless, chicken is either undercooked or overcooked . That's said and done now the waiters/servers (maybe it's me who got worst of all) not interested, always in hurry, wrong orders noted, when demanded for the order to be cancelled will argue that it can't be cancelled. Seriously? Overall a BIG disappointment! Not coming here anymore."], "rating": "4.0/5"}, "https://www.zomato.com/bangalore/big-pitcher-airport-road": {"name": "Big Pitcher", "location": [12.9601005379, 77.6468677819], "reviews": ["This was my second visit to Big Pitcher. Its a nice place. The food is good. Their brewed beer is also nice. The dance floor is in the 4th floor for which there is a cover charge of Rs.1000 per couple which is redeemable inside. The dance floor is big but it was very very crowded, maybe because of a saturday. They play Bollywood songs on Saturday night. Overall a good experience.", "I visited this place on my very first trip to Bangalore. And what an amazing experience it was. It was a bollywood night and the dj was superb. One of the best dance floors I have been to. The next time we went in search of some north indian food. Well it stood upto the expectations.", "After hearing a lot about this place, finally decided to experience it first hand. You are never to miss the rocking facade of Big Pitcher when passing through old airport road.", "To my utter amazement, this place turned out to be a stunner. From food to ambience, and from service to music.", "Great food and beer. I had a great Saturday afternoon with my friends. Very courteous staff , special mention for Sahadat, who was extremely attentive throughout ... the prawn starter is to die for...Keep up the quality of food and services, Big Pitcher! :)", "Brewed beer ,hot starters and rain defined my evening at Big Pitcher ,I guess this is the first time I went that far from my place to get beer !", "Big Pitcher = Big Satisfaction", "I had the wonderful opportunity to change my disappointing experience in Big Pitcher with an amazing one and I couldn't be happier.", "I have been for the lunch it was a awesome day for me spl thx to the big pitcher management", "A true meaning to the word terrible, this place managed to disappoint us in every way possible. We had been here once before and had a decent time but this time it came as our nightmare. Everything was just so bad. I would give them minus stars for their service if there was an option for that. Pricey for no damn reason, ill mannered staff, bad DJ and on top of that bad food. I wouldn't go there again and wouldn't suggest anyone as well."], "rating": "4.5/5"}, "https://www.zomato.com/bangalore/hakuna-matata-jp-nagar": {"name": "Hakuna Matata", "location": [12.8940288168, 77.5865978748], "reviews": ["Its just a fantastic place. The ambience is very good,the service is quick and the food tastes fantastic. The murgh Patiala curry is extremely good. Overall a must try place and is very good.", "The place is beautiful but generally you don’t get the outdoor seats as they are always full! The ambience and music are great. A beautiful place for romantic dinners. The hot and sour chicken soup was amazing. Also, we loved the egg wrapped chicken fried rice and rogan josh. A must visit with your loved ones❤️ The staff is very courteous and accommodating.", "Well known for the ambient atmosphere to spend your evenings in south Bangalore. It’s planned well with large parking space inside the compound and housing space starting in the open, wooden chairs and table with a small pool out on the left and dual cylindrical deck with ringside cushioned seatings - Mainly for the families. As we pass through you get to the bar counter. We sat in the open next to the pool ordered - Tom & jerry, day dreams, Charlie Chaplin, chicken lollipops which was served interestingly and appetizing. Briyani with raita was delectable. There is whole lots of dishes they serve and very tasty too as I tasted from my frnds plates too. We had a very peaceful time with amazing atmosphere and pleasant music made me drozy, wonderful place to be. Definitely for the residential in the neighbourhood.", "Excellent food and very friendly staff loved the experience here would definitely prefer coming back soon and would recommend this place to all my friends looking for dine and wine in the surrounding vicinity enjoyed the evening especially the food was very well cooked a five star experience", "This was an amazing place with a wonderfull service !! The food and liquor both were pocket friendly !! Cool ambience and a really good place to hangout with friends !!", "❤️Must try: babycorn satay & Singapore noodles 🍜", "Bangalore people trust me don't miss this place if you're really in search of good food with beautiful dining experience. I enjoyed my evening and will recommend you too to plan any date or outing soon in this lovely place.", "A pleasant place for dinner anytime. Good atmosphere and ambience. A very relaxing place to hangout with family and friends. Good food, drinks and music.", "Quite disappointed with this place. Looking at the ambience and rating, expected alot better taste from this place, the service is bad and wasn't worth the money at all. Even the presentation of the food was bad. The rating is only for the ambience. Over all experience was not satisfactory.", "Nice ambience. It would have been better for dinner as they have outdoor arrangements. We went for lunch. Starters were good. Soup was not nice. Main course we had Hakka noodles, peshwari murg, butter/garlic naan it was nice. Mocktails were great. Must try Charlie Chaplin Mocktail.. Will have dinner some day"], "rating": "4.2/5"}, "https://www.zomato.com/bangalore/barbeque-nation-indiranagar": {"name": "Barbeque Nation", "location": [12.9624781805, 77.641678378], "reviews": ["Well I don't need to start with the ambience and what this place is about. But what is important to note is there are almost 10 outlets here in Bangalore (at least that's what zomato says) but this is the best one, perfect barbeque, whole lot of attention from your server (more than your wife, take it from me). Great menu as in any of their outlets with their chefs putting the magic spell on your taste buds. If you can reach Indiranagar then among all the outlets this is the one to go.", "I've been to this place a few days back with a crowd of 8 ..not much to say about this place .great barbecue's (the name said it so ) good service", "I have been to other outlets of barbecue nation but this was my first at Indranagar which i guess is the highest rated and i really liked the overall atmosphere in this place!", "One of my friend was recommended this place. So I been this place nice place food was awesome. Service also.", "One of the best barbecue places in Bangalore. Probably the first one to start this kind of restaurant in city. They are known for their unlimited starters and desserts spreads. One of the famous destination for team lunch and birthday parties as one needn’t spend time on placing orders . Staffs are obsequious and service is quick. Prawns 🍤 Grill is my favourite out of all.", "The very first place I have been in Bangalore 6years ago. I experienced the buffet for the first time and i was full. I liked the food and the ambience n services.", "Barbeque Nation has a standard buffet place to go to. It has always been a place where we want to go bonkers on meats. Whether it's been in Chandigarh, New Delhi or now in Bangalore. But This branch in Indiranagar is way too good of even Barbeque Nation. They have better service and don't try and keep feeding the useless stuff which makes you full and skip the main course. Good ambiance and staff.", "One of fentastic restaurant in Indira Nagar . This place is having liquor also which is very good and and expecially bbq starters are pretty good during drinks this made us happy . Should visit this place and I am recommending this place.", "No words can explain this place . Only your taste buds will do so. Ambiance 4.5", "A good place for team lunch/dinners and for large family gatherings. Many outlets in the city and this one is the closest to my work place, went here with some clients from US for dinner."], "rating": "4.7/5"}, "https://www.zomato.com/bangalore/kota-kachori-koramangala-6th-block": {"name": "Kota Kachori", "location": [12.9361486969, 77.6254094392], "reviews": ["The batura was not cooked well and they missed out on giving one curry which I had ordered but Zomato was kind enough to give me full refund! Kudos there", "Had read a lot of reviews that the food is good. However, on the contrary, most of the delivery reviews complained about \"missing and incorrect items\".", "A second breakfast place I visited as I didn’t enjoy the first one. So was partially full and tried only their aloo pyaaz kachori and the Kota kachori. Strong flavour of hing which hits you when you take the first bite but then you get used to it. Great place to try out when you are in the mood for authentic North Indian cuisine.", "it's just yum.... can't explain how I feel now... I would suggest please don't miss this opportunity of 50% discount which is going to end by this 15th .. try it I am sure you will love all there sweets.....", "The food is amazing as always. The authentic taste of Rajasthan. As I got the food delivered thru Zomato , I would recommend if they can parcel the Kachori in box which doesn't leave stain. For the brief moment , I kept the Kachori parcel in my bag, and the whole packet left an oil stain on my bag. They current parcel Kachori in brown bag which passes stain to everything they come in contact with.", "Its located near the Sony Signal. Very Popular place. Proper sitting area on first floor. The Alu Pyaaz Kachori is best. Kulfi is also great. A busy restaurant throughout the day. Also, can try Lunch menu which too is good.", "Ordered ghevar and my God it was the tastiest ever eaten. As soft and delicious as it can be. Must try atleast once and I bet you can't just have one :)", "Great place for budget friendly ,simple and typical North Indian food.", "Yummy food. Very authentic tase. Loved the kachori and puri sabzi. Though veg pulao was not upto the mark. Neither tasty nor quantity was appropriate. Rest the food awesome.", "Will forever be in love with the food here. It's not the least bit pretentious, so to say, and will definitely be filling. Mini Malai Ghevar and Special Thali are my personal favourites."], "rating": "3.9/5"}, "https://www.zomato.com/bangalore/hoot-sarjapur-road": {"name": "Hoot", "location": [12.9141419387, 77.6785051078], "reviews": ["If you are a party animal (and even if you are not), then Hoot should be added to your must-visit list immediately!", "Went to Hoot after a friend's suggestion- quite a big place and nice ambience with water and a boat in the middle. Plus point they serve hookah as well.", "The pool wasn’t looking similar to what’s shown in the profile picture , however I still liked the ambience. Sitting arrangement is of all metal chairs ( FYI). The 3 chicken legs were too good , pls do order if you visit . Followed by chilly chicken which was good and then lollipop which was alright. The staff was super busy so the service had to suffer . 3 pax 8k bill with alcohol had rs.800 service charge which wasn’t worth.  I requested them for waiver it... first I was politely refused but then they removed it and we paid necessary tip by cash.", "This one was long overdue, pretty famous in Sarjapur and I remember the time when getting a table here was a pain.", "Hoot", "Starting with the ambience its amazing I just loved it. The feel of the place is so uplifting. And I loved the taste of the food which i did not expect to be this great though i heard a lot about this place from my friends. Would love to visit this place again.", "Came here on a weekday.. pretty empty and ambience was not great . Music was sad . Food was good . But not happy at all after visiting with all that hype", "When we heard about another Microbrewery opening up in Bangalore, we couldn’t wait to try it. And Hoot sounded extremely promising. Located in Sarjapur Road, Bangalore, the brewery is not hard to find at all just left hand side of the main road.", "It is one of those places which will leave you mesmerised. So many people. So much booze. Such great music. And, a beautiful ambiance. This place can take someone's heart away.", "Hoot offers unique ambiance and spend great music at their place. Generally packed fully and hence becomes highly difficult to get table. Service is something that could be worked on. If not the best micro brewery but definitely one of the better brewery in Bangalore."], "rating": "4.3/5"}, "https://www.zomato.com/bangalore/the-london-curry-house-race-course-road": {"name": "The London Curry House", "location": [12.9852596, 77.5793067], "reviews": ["They don’t accept advance booking so you invariably have to be in a queue on weekend evenings ! Thankfully there offer valet service. After the wait, we were ushered inside to a nice green ambience but it’s very crowded and cramped inside . So it’s a task to reach ones table. It may get hot outside though there are pedestal fans. Coming to food, I did not like as it’s way too oily. Pani puri wasn’t good and the batasha was stale. There wasn’t anything great about mocktails or main course either be it malai kofta or paneer. Services were ok.", "This place is one of the best take away place.Yes I say again “TAKE AWAY”.Went to Curry house on saturday evening for the first time and learned self service.First this restaurant illegally put a board outside that they charge Service charge of 6% which is obviously not clearly visible while entry, you only see it while exiting after paying service charge .Food is good and presentation is awesome.Ambience is very good with soothing lights.But service is the worst , I was doing self service and Bar ...now that’s the place to avoid here.Pathetic Bar tenders with zero knowledge of liquor.Worst part is staff , first time in my life I had bent down and request waiter to just leave us alone as we didn’t want to create any ugly scene with families on board.", "One of my office colleague have been talking about this restaurant whenever we were visiting Bengaluru. So this time we got time to go there for dinner. The place was super packed. So I didn't take a minute to understand that the food is good. When I looked at the menu card, I realized that the dishes were not the regular dishes but lot of creative preparation. When we got our ordered dishes services I realized even the style of serving was also very creative. The restaurant is a pure veg restaurant.  All in all wonderful experience and good food. Will be back again as there are lot of dishes on the menu card and want to try most of them.", "A crowded British themed restaurant in the heart of city. Absolutely loved the ambiance. Food was excellent although service could have been better. The spread comprises of European foods with an Indian touch which is unique. Try pani puri and cooker ki biryani.", "Have visited London curry house multiple times and the place is always jam packed.", "This place, hands down, offers the best food in the city. I have had my fill of exploring restaurants across Bangalore and nowhere have I experienced such food concepts, such presentation and such taste. I usually refrain from giving a perfect score to a restaurant but The London Curry House deserves it.", "Brilliant place for vegetarians! Good ambience , good food , decent pricing. A new twist to indian cuisine , nice place for a family outing.", "A must visit place for vegan cuisines!", "What a wonderful find! We went there for lunch. This is a vegetarian place but the variety offered is amazing. For staters we had patrani paneer and pani puri. Beautiful presentation! The paneer was super fresh, pani puri came with multiple fillings to make as per taste. Loved the food. We were quite full with the starters so ordered only one main, which was the sizzler, it was very yummy. The quantities are huge, so be careful while ordering. This is a great place for pure vegetarians. Will definitely go again. The staff is courteous and helpful. Had a great time!", "I have no idea why this place has such a high rating on Zomato. The ambience is frankly just alright - it was extremely noisy IMHO. Service was terrible. There were a couple of times I had to walk up to the kitchen or bar to get the waiter's attention and ask him to come over to our table. They served us our appetizers but there was no cutlery at the table and we had to wait another 5-10 minutes for them to bring us the cutlery."], "rating": "4.3/5"}, "https://www.zomato.com/bangalore/tbc-sky-lounge-hsr": {"name": "TBC Sky Lounge", "location": [12.9228727861, 77.6515448838], "reviews": ["Excellent service and amazing food!", "Comes with just with a single warning... TBC is really slow in service... Rest all seems perfectly ok. Great food, ambience and courtesies. We had Peri peri chkn, bbq chkn wings( awesome it was), potato wedges, babycorn chilli(again good), chkn lasagne( the best), chkn arrabiata and Chinese choupsey( good it was). We ordered some mocktails( it was ok). Was it value for money... I would say a tad bit pricey... But a grt place.", "It was my birthday evening 31st May2018. And what great they served us it was just mesmerizing and awesome the way we were treated. I am really sorry, I forgot the name of the person who served us and I am not able to mention it. But it is good place from food, place, ambience perspective. A must visit in HSR if you are looking for good treat.😊 Thank You", "The place is beautiful ❤️ We went out for a Saturday dinner. The crew is extremely friendly and helpful.  We order martini and LIIT for drinks and both were very good and worth the price. For starters we ordered Peri peri chicken and Fish and chips, the peri peri chicken was a superlike and out of this world! A must try. However, the batter of the fish and chips was too thick and not so good. We also ordered Mutton Rogan Josh for", "The location of TBC is excellent! And the interiors are inspiring too!", "It's a very average place. Ordered barbeque wings, ghee roast chicken, french fries, chilli potato wedges, chicken lasagne, veg arabiatta. Only the ghee roast was good, the rest of the dishes we ordered was ok, nothing great. As for drinks do try the TBC Paradise (cocktail) it has a sweet-ish taste.", "The rustic look and the industrial theme makes it a hit among the youngsters. The best part about this place, undoubtedly, is the pleasant service of the courteous staff who make you feel at home...! The seating areas are well arranged, with rooftop being a total favorite (thanks to the awesome bangalore weather). Great place to hangout with friends, colleagues and loved ones on any day of the week...!!!", "Amazing place. Amazing environment. Very good and vibrant ambience Thank you so much management for the awesomely arrange party. Will definitely recommend this place in HSR.", "A lovely place to hang out with friends or with family", "A very beautiful and friendly place. A family environment.  Food tastes amazing."], "rating": "4.6/5"}, "https://www.zomato.com/bangalore/boho-koramangala-5th-block": {"name": "Boho", "location": [12.934546, 77.616048], "reviews": ["Well well, even before I visited boho my colleague who's a fan of this place kept saying that \"Boho's Lit\" from the moment we discovered that our team dinners going to be here. Yes that's the second team dinner within a month I joined, I'm lucky may be! There was already a build up and did boho deliver what I expected? Yes absolutely!", "This place is a different world for the loud music lovers. It sets you on fire with its music. Food is definitely not the real star here. But it won't disappoint you too.", "Boho sets your mood just right as soon as you enter. When old school tunes get mixed with modern interior, result is a pretty looking boho.", "While the ambience is great and food is quite nice, I personally thought the sausage platter that we ordered, Wurst Idea Ever was highly overpriced for the quantity.", "We went on a Sunday night, even then there was enough crowd for everyone to shake a leg. The DJ was okay.", "Went to boho on a sunday night, surprisingly found a place to sit! The music was awesome which is why I visited again later, decent ambiance, they have a huge screen for watching sports and stuff. Best part was the fact that the entire place is kind of a disc, like stand anywhere and start dancing!", "Great ambience, good interiors, nice decor, friendly staff, but food!", "The bouncers in the entrance are not at all friendly .we were 5 couples and would definately make a huge bill but they say you have to pay 2000 per couple and no cover for that . What rubbish and all the people he knows are let on for free . If your taking 2000 atleast give full cover for it .", "What's there not to love about Boho on a Saturday night? The music is great, the crowd is young and happy, the food is delicious and the drinks are good too. Located in the happening JNC area, this place stands out in a good way.", "Amazing Place with Top-Notch quality food and drinks"], "rating": "4.1/5"}, "https://www.zomato.com/bangalore/echoes-koramangala-koramangala-5th-block": {"name": "ECHOES Koramangala", "location": [12.934125675, 77.6157524809], "reviews": ["ECHOES!", "A cute little cafe tucked in the between the pubs and discos of Koramangala, run by specially-abled staff members. An additional point goes behind the thought for this. The ambiance is pretty good but there is minimum space between the tables. The process for ordering food is explained to you while handing you the menu and it was pretty simple. One had to write down the codes given alongside the items in the menu and call the staff via a switch which lights up a bulb hanging above the table, so that the staff members could get the signal.", "A socially responsible model with food forming its core is what makes Echoes a legend! Looking at specifics, my favourite is the Tandoori Momo!", "First of all kudos to this place for giving employment to people who are challenged ...", "Some retro led zepp playing in the background, bricked rustic walls with posters worth looking out for, waiters differently abled... this place sure will charm you with its unique style. Starting from writing codes on paper for each menu or calling the staff with a switch; things are done differently here. Coming to the food this place serves excellent dishes from stuffed mushrooms to fish n chips. Both just turned out amazing! My order came in a bit late with my wife sipping her drink and me waiting for the tandoori dish the waiter got me a drink on the house! I must say they sure know how to calm a hungry stomach. Nevertheless, extremely satisfied with the overall experience. Definitely a must visit spot!", "Hi nice casual dining place with special servers. Ambience was nice, food ok, service is fine as long as there are no special requests as these can be a bit difficult to explain.", "I just love this place and would give a double thumbs up👍👍. The ambience is amazing and serene. The staff here are specially abled. Such an awesome concept and the whole theme is so inspiring. Rather than me saying what all unique things are in the store, I would suggest please head up to this place and figure out yourself and I promise you will not fall behind than getting awed. Staff service is extremely good. Food taste is super-duper. The nachos were my favorite, but the red-rave(red velvet shake) truly stole my heart 💓. The songs that were being played were also good. Overall experience : top-notch !", "It is not just an ordinary place. It is a place with life of its own. Its unique way of communication with signs simply elevates your soul for starters.", "Visited this unique place along with my college friends, they have nice staff who are hearing and speech impaired. They have this unique style of take orders. Food taste and quality is very ordinary.", "Tucked between loud pubs and discs..is this quaint little restaurant with a difference. The staff is hearing and speech impaired and you are to write down the order and ring a bell to order..."], "rating": "4.6/5"}, "https://www.zomato.com/bangalore/indigo-xp-koramangala-5th-block": {"name": "Indigo XP", "location": [12.9325731882, 77.6140559837], "reviews": ["Awesome rooftop experience, Drinks are okay.", "Came to this place on my birthday eve, was not disappointed. :)", "A great place with decent food, good drinks. The only gripe was the music. The song selection could have been better.", "A beautiful place to hangout. Quick service. Not picy as well. Friendly staff. Tasty food. Wide variety in alcohol. A complete package. Their Kung pao chicken is ammazing! Please add some Chinese gravy dishes to complement the rice /noodles.", "The newly renovated Indigo XP is a must visit. The crowd is good here all the days of the week i believe. However i have some serious concern regarding the time taken by the waiters to take/bring us our order. On a saturday night, we ordered beers and food which took more than an hour. And the waiters pretend to not hear when called. It got irritating. But i love this place, so kindly take care.", "The rooftop is the perfect place to sit, which has a good ambience and gives a good view of the neighborhood. We had a good experience with zomato gold. Also, for people who like LIIT and would want to try something new, go for seven sultan's of swing.", "Since it was the grand finale of the IPL series we wanted to opt for the best venue in the town. After the unanimous consent of the group of 9 members we zeroed in this venue. Initially we got the table inside which wasn't exciting but after sometime we got it outside which was simply amazing. The decor especially the vertical landscaping was just mind boggling. We thoroughly enjoyed watching finals at this heavenly place and chit chatting with our besties. However, all this was short term n started fizzling out as we started ordering. In drinks, most of it was out of stock which was disappointing. Coming to munchies n mocktails, we ordered variety of stuff like tropical delight, tangy tongue, mango berry colada, hurrican, nachos, onion rings, salt n pepper corn, tempura fried chilli paneer etc. which further fueled our disappointment level as nothing was impressive. Chilli paneer n mango berry were still decent but onion rings, hurricane n nachos were just terrible n tasteless. We were so disappointed that we decided to go to a different venue in mid of the innings. Someone rightly said \"All that glitters is not gold\". I would've given 2.5 but giving .5 extra for their ambience.", "So, it has two floors. There is a club where they charge you an entry fee. It's on the 3rd floor. The other is the rooftop. The bar is centrally layed out, accessable from all sides. Also, it has a side which is not covered by any roof and the view is just amazing.", "Been here just for some hard liquor and as we enter the place it gives you a very different feeling. As being an open sky of sitting under a roof to watch the match on that big screen.", "Went to this place on saturday night 26th May, i had heard a lot about this place and wanted to visit from long time."], "rating": "4.3/5"}, "https://www.zomato.com/bangalore/toit-indiranagar": {"name": "Toit", "location": [12.9792037004, 77.6405562088], "reviews": ["One of my favourite place in Bangalore as you get freshly brewed awesome beer here. Book your table in advance as this place tend to get crowded always in the evening.", "One of the best microbrewery. Their pizza and beef stack was superb. Ambiance was very nice. All stuff was very friendly. If you confused with the menu they will guide you nicely.", "Toit is located right in the beginning of indiranagar, has a very unconventional build, you can taste the freshly brewed beer, it is fairly priced and a great place for beer lovers to enjoy the fresh beer which is heavenly.", "One of the best places in bangalore for craft beer.", "The food was excellent ... service awesome ... Can't believe  I didn't know about this restaurant. Thanks to a friend I do now", "Went there on a Saturday evening, it was around 7pm when we reached so didn't bother to do prior booking. We were so wrong! The place was already full, all 3 floors of Toit. Prior booking is highly recommended.", "It completely lives up to it's hype maybe even more than that.", "Great pub, nice ambience and superb location", "I can't think of a reason why I didn't write a review for toit despite having visited this place numerous times since it began.", "Though rated so high in this place is no value money and this place is recommended ppl who want to the big crowd that's was famous I have been their for so many time only for the beer but this time is very worst I would not recommend to any of frnds becoz the service was the worst part and even the AC could be better wre I was not able to breath also. .. plse try to do something it"], "rating": "4.4/5"}, "https://www.zomato.com/bangalore/the-13th-floor-mg-road": {"name": "The 13th Floor", "location": [12.9753236578, 77.6050467789], "reviews": ["The view from up there is one very good reason why you should visit the 13th floor and especially so at night. The ambience sets the mood for a night out. The food is quite good and even the lunch buffet has got a whole host of items on the menu which, while not comparable to barbecue nation, is still quite good. The service is excellent as well despite the crowd.", "The 13th floor could be the best place to make party with ur love one. Amazing place around the city", "The place has a great view and is very nice for dates and romantic dinners. The restaurant gives a great view of Bangalore skyline. The music was a mix of retro English and contemporary pop. The food was good. Not amazing but decent enough. Overall the place is a little overpriced and might burn a hole in the pocket if you have a drinking binge.", "Have visited this place couple of times in past but this time they had cover charge 1000/- per person.", "From my friends I heard a lot about this place. So last month we thought of visiting here for Bachelor party on Sunday evening.We were group of 6 people.", "One of the best place I visited so far..!! The view from here is great, the ambiance is good and food is really great.. u can have a peaceful time here with booze and soft music..!!", "One of the favourite lounges over the years, has great views of CBD ... A great place to be in on a windy Bengaluru evening.", "What an amazing night I had here! Loved their ambience, music and FOOD! Courteous staff. One of the best Saturday night was spent here! Highly recommended♥️", "Had been to this place on a weekend with few of my friends and I have to admit that it is a nice place to chill. The view of Bengaluru lit from the 13th floor is breath takingly beautiful. Service is pretty good with nice music. Live sport screening is also available. Tried gun powder, chicken and fish starters with few drinks and totally loved the taste of food. Would definitely visit again.", "This cafe is near the Church street in Bangalore. If you are looking forward to spend a peaceful evening with your friends and family then this the place to visit. The food is pretty good , I had ordered Nasi goreng and a quite lot of platters . For Dessert I would recommend to try the caramel toffee pudding. It was delicious ! Also this place gives you a beautiful view of Bangalore along and the cricket stadium along with some cold breeze which is definitely something to look forward too."], "rating": "4.1/5"}, "https://www.zomato.com/bangalore/corner-house-ice-cream-indiranagar": {"name": "Corner House Ice Cream", "location": [12.9700249298, 77.6375571638], "reviews": ["This is one of the best and popular ice cream parlour chains in Bangalore which many branches around the city. Many varieties of milkshakes, ice creams, chocolates, sundaes and other things are offered here in this parlour. Death by Chocolate is one of their signature and most popular ice creams offered by them. Parlour will be overcrowded on the weekends by college students and the other age group people. It is always preferred to go here to this parlour with your friends, family and also with the corporate office colleges. You will never get disappointed with this parlour whatever going to order from here. I love to go to this parlour again to taste all other ice creams varieties as well. I recommend everyone to go this parlour and taste all the ice cream varieties.", "Well, no review of this place is required. Always the best quality for the price. The place is always crowded but they have a lot of seating. probably the biggest as compared to other outlets. The favorite order had been Death by chocolate but recently have shifted to Cafe Caramel and Fruit Jackpot.", "Best place in Bangalore for custom ice creams and sundaes....", "This place doesn't need much of an introduction or review really! They have maintained taste and quality at very good prices since a long time. So go ahead and try every flavor you can but don't forget to wear a mosquito patch incase you intend to sit and enjoy your ice cream! Maybe they could do something about that!", "The go-to place for sweet treats and ice creams. There are many amazing options to try other than the cliché DBC (Death by Chocolate), if you're a fan of fruits, like Fruit Jackpot, Impeached, Lychee with Ice Cream and Cream, etc. :)", "When you feel low or you feel happy...the best go to dessert place for a quick recharge is the corner house. Love their DBC and can drool over it for hours....a must visit place. A big thumbs up for their generous portion size. Cheers!", "People, if you’re visiting Bengaluru and if you’re an ice cream fan, dare I say, do not leave the city until you visit this place. To digress a bit, while Archie’s comics introduced us to the world of pizzas and burgers pictorially, Corner house gave us the best of those and were the first in Bengaluru to offer them. Alas, they are no more on the menu and I soooooo miss that. Pizza, burgers and their yummm apple pie. I am still looking for those flavours and haven’t found them yet. But NOW what you just have to eat here is “Death by chocolate” and it simply is that. Drool and salivate. There are others too that are good on the menu but for me “Strawberries with ice cream and cream” & “Death by chocolate” is the deal.", "The best thing about this place is that it’s open till 11:30ish. You can have an ice-cream craving suddenly by 11pm and still make it here (if you are nearby).", "The chocolate caramello pudding and the brownie fudge sunday are to die for. what I like better about the place is that its open spaces and quiet ambiance that makes it a nice place to chill, relax and enjoy really good and fresh ice-cream. It's not a place that charges a bomb for you to sit on a stool and gobble up your ice-cream and leave.", "Corner House is a real delight for any dessert lover. This outlet is especially very spacious with lots of seating facilities. But it can still get pretty crowded in evenings. They maintain the same standard through out all their outlets. Would love to see them stop serving in the plastic parcel container and start giving a little more importance to the way they present and serve."], "rating": "4.6/5"}, "https://www.zomato.com/bangalore/meghana-foods-koramangala-5th-block": {"name": "Meghana Foods", "location": [12.9344913298, 77.6162040979], "reviews": ["Out right one of the best chicken biryani I've had with no compromise on the taste in a take away ! MUST have meghanas special chicken biryani...it's delicious !!", "Boneless chicken biryani... Recommended", "Meghanas was a favourite haunt for those of us who studied in Christ for their delectable Meghana Special Chicken Biryani. The boneless biryani is full of flavour and the portions are huge. I’ve on occasion tried their paneer biryani, chicken 65, mutton pepper fry and chicken kebabs as well and all of the above taste good. But  what takes me back to this popular food haunt every time I visit bangalore is their yummy full of goodness biryani.", "A small place which serves food till late in the night. So if you were partying hard and forgot to order food it is the place for you.", "Meghana foods , this particular restaurant has one of the best Andhra style food in this city . As a pure vegetarian i just love the Allu Dum biryani , phulka with paneer butter masala & Green peas curry. And dont forget about the starter’s they do make it spicy .", "Even though m sick of having rice daily from the day i came to bangalore, i went to this place. Famous for biryani, and i got to know why it is famous.", "Best place for biriyani in Bangalore. Ordered two biriyani and two appetizers for four people and we kinda struggled to finish it. The Paneer biriyani costed more than the special chicken biriyani , but both were really good. The only disappointment was the chilli fish, it tasted very very average.", "One of the famous and  busiest tasty n spicy biryani outlet located in Koramangala.", "I had ordered food from this place via some delivery app. Every item was tasty and perfectly cooked as it should be. Would love to visit this place for more Veg items. Biriyani's are always great here with quite good quantity. I am in love with Dum Biriyani.", "I had gone to this place on a Saturday afternoon and had their special biryani. To be very frank it was just, there was nothing so special about it. And the ambiance of the place was not good."], "rating": "4.0/5"}, "https://www.zomato.com/bangalore/the-black-pearl-koramangala-5th-block": {"name": "The Black Pearl", "location": [12.9344024486, 77.616128996], "reviews": ["3.5 rating specifically", "Went here for a team outing from office. The buffet seemed like a viable option for us. First of all, do reserve a table here whether you're going on a weekend or a weekday. It's almost always full. For a lunch, they have booking slots at 12 and 2:30, so plan your lunch accordingly. When I went, there was an offer for unlimited cocktails and mocktails if you take the buffet. Also keep in mind that this offer stands only for one hour from the time you start ordering.", "One of the best buffet in town. Very nice pirate theme, little dark though due to the theme. Menu is usual buffet kind of. Service is very nice. Wide varieties of main course and starters, have different sections for them. Live music.", "A great place for team lunches or dinner. They have offers for corporate gatherings which is a plus point. Going by the name, it's a pirate themed restaurant and have the usual menu for the buffets. The food was pretty good as well as the ambiance (a little dark though due to the pirate theme) and the service.", "I had visited here for lunch buffet...The good yummy...there are many options in starters...the barbeque was good...and they serve golgappa which makes its menu different...the desert they serve has lots of options...must visit restaurant", "Excellent place for team meetings and team builing exercises", "Had been here for team lunch, the place has a nice ambiance with Pirates theme but seems to have aged out.  I felt the seating to be very cramped with little space to move around.", "The first pirate themed restaurant,everything is average compare to their other Branch. So congested and uncomfortable seating.There was nothing new in the desserts and main course .over all it end up being an average restaurant", "Great ambience, beautiful atmosphere. But it's hot in here!", "Been to this place many a time .Food is good here . It's an usual buffet with lot of varieties . Starters are amazing with good unique flavours . Main course on the counter was hard to choose since we were full . Typical North Indian biriyani and some rotis with gravy for the main course which was good as well . Mutton served here was tender . Desserts a huge variety , everything was good except one or two . It's been a long time . Will visit during winter ."], "rating": "4.4/5"}, "https://www.zomato.com/bangalore/brooks-and-bonds-brewery-koramangala-5th-block": {"name": "Brooks and Bonds Brewery", "location": [12.9342338357, 77.6234309748], "reviews": ["Love this place. Been there thrice and its excellent. I love their mango beer, its like mango milkshake, has a strong mango aroma as well. Very pleasant to drink. The other beers are decent. Nothing great. Stout was pretty good. We tried pizzas. They were good. Even the starters were decent..Ambience is very good.. They have noth rooftop and indoor as well. Place is totally worth visiting.", "A decent place to be in..", "Overrated. Service is pathetic. Staff not at all helpful while getting a table. They forgot to apply Zomato Gold discount on the bill. Beer is mediocre at best. Most other drinks are not available.", "This place is just awesome! If you’re making 2 visits in a weeks time, this tells a lot how awesome this place is. Totally not expensive, amazing view from terrace & lovely food with great brewed beers!", "Awesome food and even awesome cocktails!! Ambience is really nice , especially the roof top. This is really good for couples. The lower floor is good for friends who wanna hang out and also see the match screenings.", "This is one of the latest entry into brewery scene in Bangalore. This pub is located in one of the most party goers place in Bangalore. The drinks are very good, especially the brew variants hefe weizen and mango cider. We had pizza, chicken steak, pasta and few chicken starters. Apart from the steak other foods were tasted very blank. The ambience is very nice. The service is very slow. Overall an average experience.", "Eagerly waited to check out the new brewery in Bangalore, but utterly disappointed with the service. The wait staff were roaming around here and there, and did not pay any heed to our order or requirements. Towards the end, one of them mixed up the order and instead of rectifying, he started being aggressive and refused to correct the order until we finally sorted it with the manager. Heard a lot about the place, but the staff needs to be trained to pay more attention to the customers. Although, the beer wasn’t a disappointment.", "This is one of the most coolest brewery in Bangalore. 2 floors, and each floor has an inside and an outside seating area. The place serves one of the best Mango Cider beers I've ever had! It was so so delicious.", "Visited this place recently nice ambiance and good crowd though it was a weekday visit and they serve good breweries if you are going do try mango flavoured one that is good as they also suggest the same food is also good more importantly it’s cheaper compared to other places over all a thumbs up for this place", "Loved the ambience and great food. Specially the beer. It's the only brewery which has 8 beer on tap and such a strong mango cider which is my favourite. You guys should definitely try it out. It's extremely refreshing yet very strong. Great service and good music. Great for office parties too as it has a great spread out place. It's the next big thing in town and you all should try it out."], "rating": "3.9/5"}, "https://www.zomato.com/ArborBrewIndia": {"name": "Arbor Brewing Company", "location": [12.9704499953, 77.6110559329], "reviews": ["Place of joy..", "“Spacious yet crowded and noisy place with fantastic craft beers!”", "After two unsuccessful and attempts, was finally able to book a table!", "When in doubt or in lack of options, this place is the one to look upto. Good vibe and some good food with great cocktails. If you have not explored this place yet, please do so. And do try their amazing cheese garlic bread. Not to forget, do try the samples of all the beer varieties they serve.", "We just loved the ambience and the playlist. Lights play a very important role in creating the ambience here so try visiting the place after sunset. The brewed beers are impressive and the wheat ale pale is a safe one to start off with.", "Great place with fantastic vibe, this place specialises in Brewed beer. Huge seating spaces, outdoor seating with smoking options. Food can’t be a let down. Pricing is very pocket friendly", "Amazing ambience. Excellent service. The beers I didn’t like so much. Most of them were too fruity for my taste and the stout was flat.", "We had been meaning to try out this place for quite some time as we have heard rave reviews about it. As you walk in, you see a massive setup with both indoor and outdoor seating. The entire place is very well lit with tungsten lighting and all the furniture is wood which gives it a very rustic feel. The elephant in the room obviously is the massive brewery which is visible to everyone behind a glass panel. They serve about 8 varieties of Beer which is more than almost anywhere else in the city.", "Great ambience, great beer, spacious interiors but the only letdown - incredibly rude staff at the entry desk. She made us wait for a long time at the entry area while she completed a phone call! I mean, the place wasn’t even crowded at that time. There were plenty of empty tables. She could have easily given us a table first instead of making us wait for an eternity for no reason. ABC should either train their staff to multitask or employ more people to answer calls and receive customers.", "Good place I just wish it was a little less crowded. This place is always overcrowded no matter which day of the week it is."], "rating": "4.3/5"}, "https://www.zomato.com/bangalore/prost-brew-pub-koramangala-4th-block": {"name": "Prost Brew Pub", "location": [12.9332149667, 77.6307839155], "reviews": ["Went there last sunday. The place has got a very rustic look. Good for people who like such ambience. We tried just some amazing beer and mojito. Looking forward to explore the food spread in my next visit.", "Food - 4/5", "Cheesy stuffed pizza + Cider Beer = Heaven", "The microbrewery is average. The place where we were given had a lot of mosquitoes. The coil didn't make any difference.", "Ambience-4/5", "Loved the dark and strong ambiance. Found the seating unusually comforting. Service was very very slow but the food totally worth the wait. Light music and IPL was definitely on. Overall a good experience, only if the service would've been better it would have been great.", "Nice food, apple cider beer is the best in town compared to other breweries..bit of mismanagement i feel initially but then the staff arranged for a good decent table in 2nd floor..also place is quiet spacious to accomodate lot of people..must say the dj songs collection was really good..", "Prost is a popular micro brewery in Koramangala and for a good reason. Their brews offer sharp fruity flavors and aromas that you won't get in any beer off the shelf. However, the crowd and ambiance of the place was a bit dull compared to other popular micro breweries in Bangalore.", "Prost is a must visit for any beer lover - as they are a microbrewery with a number of flavours you can pick from. If you are confused they also have a sampler pack at Rs.200/-. My favourite is the apple cider. Prost has 3 levels of seating, and the dim lit, cozy ambience is vibrant enough for a great date, meal with family or to watch a live match! Being a Gold partner, Prost is always a common choice to dine out for a great meal at relativel cheaper prices. Must tries are the chilli chicken, the paneer tikka, and the CAJUN POTATOS that are mindblowing.  They have alot of offers on drinks as well, and is a lovely place for a gathering or reunion! Cost for two is around Rs.1200/-, and the food is worth the price and wait!", "Prost has become my regular go-to place for delicious buffalo wings. They are probaby the best I've had in Bangalore. The service is super fast and every food item tasted good. Try their Asian bhel for something different."], "rating": "4.2/5"}, "https://www.zomato.com/bangalore/hammered-cunningham-road": {"name": "Hammered", "location": [12.9864513377, 77.5949016586], "reviews": ["This places is huge and a nice happening place for weekends . The food is pretty good and ambiance of the place is nice. They have indoor and outdoor seating available. Staff can be get much friendly and nice .", "Hammered is amongst the places in Bangalore where I went with one of my friends to enjoy the magical mist, and came out high with flying colours.", "What an amazing area they have got.", "Nice open place with different levels of dining areas. Have been there twice but normally find some areas blocked for price office parties making noise. Otherwise can be a decent place to enjoy.", "This is an amazing place. The decor is absolutely beautiful. They are really organised and professional and manage the crowd and the queue really well.", "Great place to visit. Been there for dinner. We had couple of beers. In food there was French fries, coriander and cumin chicken and Acharia fish tikka. Food was served hot and service was great. Vicky helped us and did a great job. Last the bill was given to us places on a toy van. Overall a good experience.", "A great party spot especially if u like the noise.", "A nice place with very friendly staff. The place was a little chaotic when we went because of rain. But I really liked their service.", "Not a planned visit but I am quiet happy. Since it was raining, we were given a table indoor. First thing we ordered was a soup which was okay. Then we had Tum Nachos which was excellent, nachos were fresh. We then ordered for exotic pizza, they have thin crust 9 inch 🍕,again good. I think this place was really cool, as they have both indoor n outdoor seating. Also the service is quiet fast. I would love to try sitting outside next time. More suitable for an evening catch up or dinner.", "I had come here yesterday with my friends for dinner. Had lots of fun and the ambiance of this place is fantastic. Had ordered the Tandoori Non Veg platter, Chinese Chicken platter, Wings platter, Crispy Mushrooms Chinese style, potato wedges and fries. All of the dishes were absolutely delicious. For drinks we had Vodka, Cocktail called Asian Affair and Beer. I got to use my Zomato Gold here. The overall experience was fabulous."], "rating": "4.2/5"}, "https://www.zomato.com/bangalore/byg-brewski-brewing-company-hennur-bangalore": {"name": "Byg Brewski Brewing Company", "location": [13.070964, 77.651618], "reviews": ["So offlate I've been seeing alot of posts about byg brewski and the beautiful decor caught my eye.Honestly speaking there were mixed reviews about this place and I was a little skeptical about this place. We went in the evening on a be weekday and it was pretty crowded. We got ourselves a table near the water body, the decor is just mind boggling.We ordered a few drinks and then we ordered senorita pizza wahich was basically marghertia pizza and was pretty good. And then we had chili cheese spring roll and it tastes so yummy and was crisp to perfection.Then we had Nachos and Mac cheese both tasted so yummy , probably one of the best Mac and cheese I've had has to be here . We ended up paying 3.5k for food and drinks, yes it's an expensive place but it's worth every penny.", "When Byg Brewski announced its opening in Hennur, what was a no brainer was that it was here to put Hennur on the gourmet map of Bangalore. Unfortunately, not there just yet. Hopefully soon.", "Okay. This place is impressive. It’s huge and a very very nice layout. Beautiful.", "Its much more bigger than its NAME!!", "Wow .. A humongous place to stroll around with your drinks, do a little catch up or just sit by the bar and overlook the beauty .. The reservation deck did create a little problem as we entered.. We had a friend inside who had a table but the lady asked our friend to come out n get us. Only then would she let us in. The service as of now is not upto the mark. The waiters are ignorant of what drink is getting served. Some of the areas are not yet operational and their brewed beers wouldn’t start till September. With a little here and there initial technicalities , this place is booming. The area and the ambience is amazing. Food is good and reasonably priced.. Very excited for them to be in the neighbourhood..", "A wonderful place, a pleasant change to the landscape of Hennur , wonderful food , amazing cocktails, Brewery is not running yet,can forget sangam 😂,", "It's BYG, literally. From outside it might look like a big old shed but wait until u make your entry. Various levels of sitting arrangements with Maximum no. Of occupancy any pub can offer. In house Brewery is yet to open. Live music, poolside table's, friendly staff, service was little slow though. Good food. Prior reservation a must. Would like to visit once brewery are up and running. Below are few pics capturing the vividness of the place.", "Please stop sending Promotional messages , Giving ads in mass media & Making statements such as “Asia’s Largest Brewery “", "There is one thing I can tell you , that this place is gonna be totally RAD & happening once it's in full glory . That being said please avoid this place until 1st July 2018 , cus it's so freaking huge that they under-estimated how though it's gonna be to handle this place on the weekends with out the full staff.", "2 is for ambience."], "rating": "NEW"}, "https://www.zomato.com/bangalore/communiti-residency-road": {"name": "Communiti", "location": [12.9722191879, 77.6083690301], "reviews": ["Good ambiance, great food & the best service - perfectly sums up Communiti.", "Nice place to hangout in the evening. Fiery chicken pizza was fab in taste. The devilled egg dish was something very unique and tasty too. Only thing I wanted was a bit more of variety in the menu. Otherwise its a perfect place for hangouts.", "Great place to hang around with your friends. Went here yesterday and wattay cosy ambient set up. Food was amazing too chicken tender must have. Bolognese pasta and drinks were good too. Since this is a pet friendly place would love to bring my pet and have some great time in here. Hats off to the management for being quite organized", "Looking for a place to chill with friends , this is it. Good options in food & drinks (cocktails). Location is perfect & the  place is pretty big so getting a table isn't difficult. Got their price points right as well.", "Recently visited this place for dinner and here is my review:", "Communiti is a place suitable for all types of crowds . This place has been in my frequent visit list. The ambience of the place is nice , dark and pleasant . The food here is really nice , their BBQ chicken wings and the peri peri chicken appetizers are nice and also their brick oven thin crust pizzas are really nice . Coming to the drinks , I'm in love with this one cocktail here called tequila sunrise , it's really nice and simple with not too many flavours playing around , other cocktails like the screwdriver , s*x on the beach are nice too, other drinks like their in house brewed beers are nice (do give them a try you get a taster palate) . The staff here are well trained and quickly respond . Overall this place is a go to for casual hangouts and you'll surely have a nice time here", "Truly a “communiti” bar! Good Belgian Beer accompanied with Hummus/ Lavash..Service was pleasant too! As a Hummus/ Pita bread fan, I would recommend adding Pita Bread to the menu👍", "Good location. Beer with good enough choice to choose from. Good food. Friendly staff. Will recommend to get reservations in advance. It use to be crowded on weekends.", "We had a nice time with friends. Ambience was super cool with awesome music. I was impressed by their brews. Their service was super quick. Shall visit this place soon.", "We group of 6 friends visited here on last Sunday to celebrate birthday and watch IPL finals. Ambience of this place is unique. Entry gate is like home one with small blackboard outside mentioning - 'We are Open/Closed'. Sculpture of 3 laughing kids at the entrance is one more attraction of this place. Plates printed with commmmmmmmmmmmmmmmmmmuniti, small hanging bulbs on the table and various other things make the ambience of this place really great and unique."], "rating": "4.3/5"}, "https://www.zomato.com/bangalore/abs-absolute-barbecues-marathahalli": {"name": "AB's - Absolute Barbecues", "location": [12.9497983, 77.6993079], "reviews": ["We went there for my brother's birthday. They had a great service. The food was fantastic. They made special effort to make sure that vegetarian are as comfortable and happy as the non vegetarians. BTW it's a non veg heaven. Food was fantastic. Great experience. Also the staff don't take tips even if you insist. They are very professional.", "I remember the day it was 2nd june,my birthday. I went there buffet.", "This chain of restaurants are my all time favourites. I always would like to revisit this place without any second thought. In simple words, its the most comfortable spot to have delicious food with friends and family on any occasion.", "Obviously a good food restaurant. But after 4-5 visits I found this place like a fish market. Kind of no privacy. Too much noise. But just for the BBQ this place is still on top of the list.", "Went there on a Thursday evening with office colleagues. Booking is recommended as the place got almost filled by 7 only. It was on my bucket list since a long time back.", "The place is good and the staff is also approachable. Booking table is advised . Now coming to food . The non veg buffet was pretty good, specially fish and prawns. The other menu was nothing that great. The dessert are on the ok side. One suggestion if you have a person who eats non veg but planned to eat veg on that day make sure he does not eat a single piece of non veg that day as the management will charge his plate under non veg. This happened to us.!", "It's a great place to try different varieties of non veg. Starters are amazing and they are the best non veg buffet restaurants chain in Bangalore. Recommended.", "The hype around this place was big. It did live-up in 2 aspects - very friendly staff and a varied menu. The food itself was not very good. While us vegetarians did suffer lack of options and were to console ourselves with weird dishes even the meat eating friends were unhappy due to not-so-fresh meat and a salty biriyani.", "The best place for Hangouts I have ever been in Bangalore since I am here. I have experienced its food, beverage, ambiance and the most important Service ; and i found it nowhere except this place. And this has been made me to be there for 7 times till now in last 4years.", "As usual the place is always crowded. Not much for vegetarians though, but can't blame them as bbqs are not meant for vegetarians. Good ambience but its congested a bit"], "rating": "4.6/5"}, "https://www.zomato.com/bangalore/flechazo-marathahalli": {"name": "Flechazo", "location": [12.974443158, 77.6973469555], "reviews": ["Went to this outlet which is near to my office for lunch along with my office colleagues, my first impression was not good since it was just above Nissan showroom and it was kind of in a corner and not on main road and I had never heard of it but as soon as we entered the restaurant all my perception went to drain.", "This restaurant is always crowded,but when it comes to food one will come to know why it’s crowded. So delightful ambiance and quick service. One can make their own pizzas, n number of tasty desserts along with main course 😊must visit place with friends ,colleagues and family", "It has a bright colourful interior. A bit congested to move around in buffet area and very noisy. Hospitality was good. Starters Veg variety was good. Paani Puri counter was innovative. Rest of food was up to the mark. The important point is it’s all good value for money here, found it not too harsh in the wallet for the quantity of food and ambience, good place to take extended family and friends for an occasion.", "Went there yesterday with my office colleagues. Restaurant is little crowded and it took around 10 mins to get a seat despite pre booking.", "Flechazo is located on Doddanakkundi on the outer ring road near to Marathahalli. It also has got ample parking space so you dont have to worry about the parking. In case, if you are visiting on the weekend please make sure you book the table in advance as the place will be crowded.", "The experience for buffet dinner was great. The stuff were very enthusiastic to help and guided the right choices of food. The interesting things were make your own pizza and the starter conveyor. The location is a bit odd but still can be figured out easily from main road.", "I choose this place by seeing the food menu and the photos of the ambiance on Zomato. But when I actually went there for lunch with my team I was amazed and surprised at the same time that how they are serving such good quality food in such low prices. This place is good for team lunches and the one who loves buffet.", "Spreadwise this place has good variety, viz. soups, chaats, dimsums, shawarmas, sushis, kababs, pizzas, pastas and what not to start with! We went on a Monday for a nonveg buffet @566/- at 2 p.m. and the place was full packed with people even waiting outside! Our table attendant Ashish gave a commendable service with some customised dishes served on table even within the rush around. They served welcome orange mocktail and after lunch complimentary Mojito too. The chicken biryani in main course was the best I had in any buffet so far. The mutton was a bit hard though. Only downside was some of the food items like dimsums, jalebis were cold or replenished quite late and people had to wait for quite some time even for getting dessert plates or spoons. Also we felt the waiters in a bit hurry naturally because of the rush but if this can be improved then nothing better.", "One of the finest buffet place in Bangalore.", "I went to this place for a team lunch. Tried their buffet. Good variety of food both in veg and non veg. The starters were good. But some were not hot. The desserts were really good. They have live pasta and nitrogen ice cream counter. Ice cream was really good. Service was good. Food was ok."], "rating": "4.5/5"}, "https://www.zomato.com/bangalore/burma-burma-indiranagar-bangalore": {"name": "Burma Burma", "location": [12.9705130526, 77.6447129622], "reviews": ["4.5/5", "Great Place for Veg and Vegan food. Lot of waiting even at Lunch time as they dont accept bookings on phone", "After reading through fabulous reviews of this place and waiting for nearly 45mins, we managed to get a table on a super busy Saturday night. The place takes reservations till 730pm on weekends and after that it is all upto your luck. The interiors are very nicely done up with great ambient lighting. Now for the food review: we ordered the highly recommended Samosa Soup for starters which was this tangy tomato based broth with samosa pieces submerged in it. We enjoyed the soup thoroughly. Next we went for the crispy lotus stem which was a brilliant snack that you could just eat the whole day. Who would have thought that crispy fried lotus stems with a spciy masala on too would be so addictive! We also had the masala potato steamed buns which were nice and soft and well flavoured. Ended up the main course with Burmese Falafal which was one of my favorite dishes for the night. Subtly flavored falafel in a beautiful Garlic sauce, it was super tasty!", "Burma Burma : Nice entrance but the quiet outside belies the full house, vibrant inside. It is a small space, so well done and impressive that it does not occur to us that it is in fact a small space. Good for them as the place looks full and gets buzzing quickly. Burma reminds of Burma Teak and this place while may not be BT, has a woodsy look.", "We went there on a Friday afternoon for lunch and there was a wait for beyond 20mins. Quite unexpected for a Vegetarian Restaurant.", "So, Burma Burma is a vegetarian restaurant that you'll most likely find packed even on a weekday. People are literally thronging outside this restaurant and you can surely expect a waiting time.", "Amazing food !!!", "Burma Burma is a place that serves par excellence food in every course. Amazed to see how creative they could get with salads, noodle dishes, curries and bubble teas. Interiors are refreshingly honest and a perfect blend of traditional burmese look meeting modern lines. Burma Burma is definitely a restaurant that deserves to be visited again and again.", "Good ambiance. Quiet expensive .All the items are really unique in taste . I happened to goto this  place today with my colleagues. Everyone had a good time.", "A country with a stormy history, decades of oppression from the British and then ruled over by the military, has reduced Myanmar to one of the least developed countries in the world. However, the recent change in regime to a democracy is slowly bringing Burma back into the fold of world activities, and Burmese cuisine is being appreciated the world over."], "rating": "4.5/5"}, "https://www.zomato.com/bangalore/1131-bar-kitchen-indiranagar-bangalore": {"name": "1131 Bar + Kitchen", "location": [12.9698648357, 77.6413464546], "reviews": ["This restaurant is a good place to party with a group of 5-6 friends or more. They have nice menu options such as the party length for nachos and chicken as well. The place is a bit costly with respect to the food menu. If you are lucky enough, you may be dining under a clear starlit night sky.", "Have visited the place twice and have loved it. It is a huge place and remains", "This place is really one of the best place i have been in bangalore!", "Was hungry when I passed by this place. So decided to give it a try. Went in for the open air space instead of the lounge. Top rating for their food, drinks and the ambience. Ordered a draught beer, atomic blonde. Food- basil chicken dimsums, lamb hongkong and chicken shaish tawook. Happy tummy at the end of the meal.", "Been here twice and I absolutely love this place. First time we just had drinks and the 20\" pizza. Pizza was delicious and huuuge. The second time I went had a lot of food. Everything we ordered was delicious and not one dish disappointed us. Good ambiance, good growd and am good place overall to hangout with your friends over a few drinks and some really good food.", "I loved the place! Since there were no free tables, we had to sit at the bar counter..but it was comfortable enough..we had mansion house cognac and two dishes, chicken sheesh tawook and chicken Olivetti..both were delicious!", "Had been to this place after all the hype it had created, expected it to be bigger than It actually was! But the place was lively and had good music and also has a valet parking , we ordered for a pepper chicken appetizer (which was recommended by the staff member and was okayish), chicken Tikka tandoori pizza( which was good enough) and a berry blast Mocktail, which was nice and refreshing! The service and staff is also pretty good.", "Nice Airy Roftop pub with a good choice of food & drinks. Their service was quick as well..  Their Pizzas are worth trying.. Reasonable priced too..", "1131 is a huge place to just unwind with friends and that's what it was to me as well. I stopped over there on a friday night. With the expanse of three floors that the place covers we could easily find a place. There are people of all ages around so its not really specific to a youth hangout and you can take your family out for a drink here too. ,", "Visited this Restaurant/Pub for a spot of light dinner. I didn’t expect this place to be absolutely kicking. Also, I was pleasantly surprised by the ambiance and atmosphere at this restaurant, I’ll be sure to dine here again."], "rating": "4.4/5"}, "https://www.zomato.com/bangalore/farzi-cafe-lavelle-road": {"name": "Farzi Cafe", "location": [12.9714987703, 77.5957780704], "reviews": ["Naam Farzi.. kaam? 1 number.. points.. poore 5😎 !!", "Farzi was hosting this specially curated menu for the mango season and we got a chance to try out the exclusive menu", "Been here twice assuming the 2nd visit would change my opinion but nope... but I guess it's not something that impressed me..the food is very very average here.. only the presentation is good.. their drinks & location is perfect..", "Overtly expensive for bad food. Averaged ambience, well marketed. I was surprised to see the number of takers of their food.. Good for them... Swore not to go again", "Farzi cafe is a place in Bengaluru which had sparked some controversy because of a fighting incident happened here a few months ago. I had this place on my list for quite some time so I was surprised and also worried whether they will come strong and be the place it was for many foodies in Bengaluru. I was justified when I visited here for a friend's birthday celebration.", "It's my first time I had candy floss paan, dahi lychee shots and a Aarabitta coconut pasta all the item were too good just loved it. The paan n shots were complimentary. Loved the ambience so a must visit place.", "Innovation at its best.", "The place that needs no introduction - \"Farzi Cafe\" is all set with the newly curated menu by Chef Surya offering some lip smacking delicacies starting from soups, salads and nano plates to desserts.", "Visited UB city for celebrating my wife's bday and we decided to have lunch from Farzi cafe. It was a Monday and hence less crowded we could get a table easily.We got a complimentary mango shots presented in liquid nitrogen smoke and it was refreshing. We ordered for starters fish Tikka and Santre chicken and a strawberry lemonade mocktail and french fries.The starters were delicious and yummy.Really enjoyed the starters.After the started they presented us with another complimentary item.It was a yogurt based lolipop stick. For mains we ordered pork belly kootan and mutton Irachi pepper fry.It was presented in a unique ways.The mutton dish was tasty but felt it was too much onion and little salt was more and it was served with only one porotta. On the contrary pork belly dish felt like a fusion dish in Kerala style kottu porotta.(It's not a spicy dish but was very good in quantity).Its a high end restaurant and of course prices was high, but Only unhappy part I felt was the mineral water was charged more than the mrp. Overall a great time spent.", "Molecular gastronomy has become quite popular in various cuisines over the last few years and using the same laws of physics and chemistry, Farzi Cafe is definitely a popular chain for that \"Modern Indian\" twist."], "rating": "4.3/5"}, "https://www.zomato.com/bangalore/truffles-koramangala-5th-block": {"name": "Truffles", "location": [12.933426714, 77.6143838838], "reviews": ["Now I'm not going to go on and on about the basic jist. I guess that would be too overrated. Rather, I'd like to specifically point out to three less tried items on the menu. Now the first one is the brownie fudge special sundae. This comes in a big jar and when I say big I mean it. You can't finish it all by yourself after the typical stuff you binge on in truffles. Anyways, coming back to his good it is, it is excessive excessively loaded with cream, brownie bits, lots of ice cream and some caramel pop tops. This makes a yummy dessert. Not really sure if the Mississippi mud pie is popular but it's a sinful bliss. Do go with that choice because it's the ultimate spoiler for those chocoholics out there.", "Near to forum mall... it is one of the best place to hangout with family and friends...", "Truffles is a place where you get Wide Varieties of Burgers and it is one of the Best Place for Burgers in Bangalore.", "Ambience - 5", "A short distance away from Forum Mall and Christ college, this place is a popular joint for college students. Around the time I joined college, the place was smaller but soon expanded. But such is the popularity of this place that even after expansion you would always find a crowd waiting for a table around this place. Their All American Cheese burger, sloppy joe, tex mex, American breakfast, lamb burger etc were very popular. The only complaint I’ve heard about their burgers/sandwiches is that they put boiled egg instead of the fried one in the non-veg club sandwich. Portions are huge and many struggle to finish the burgers or pasta when a couple of starters are also ordered. So choose wisely from the differing size of the portions on offer. The youngish crowd frequenting the joint can be a bit too loud and may not be to the liking of the older clientele, but the food is worth this hassle.", "If you've been saying no to this place looking at the crowd outside, think again! It's totally worth the wait. The burgers and sandwiches are great here. Do try the 4 cheese pizza.", "Crowded cafe, difficult to get a seat but if you do u vl forget the loooong waiting time with the first bite of the food. Have tried Pasta Agli-e-olio, Rosemary Chicken, Blueberry Cheesecake. All three items tasted well and quick service with proper portion size.", "Been here multiple times. One of the best places in Bangalore. Good setup, quick service, friendly staff and most importantly awesome food. Would visit more often, if only it was less crowded.", "This is a beautiful place located at Koramangala 5th block, almost near the Forum Mall. This place is reputed to be crowded at all times, with long queues for seating. And since we went on a Sunday, so crowd was expected. So from the beginning, the waiting area has mists spread to help the waiting crowd get a relief from the heat.", "The restaurant lived upto its hype. The food was worth the wait. Ambience is absolutely amazing. The burgers are something you must try and the desserts are not so bad either with reasonable prices."], "rating": "4.8/5"}, "https://www.zomato.com/bangalore/the-black-rabbit-indiranagar": {"name": "The Black Rabbit", "location": [12.969789036, 77.6411747932], "reviews": ["The place looks great, has good service and is a Zomato gold partner.", "Black Rabbit, situated in indranagar.", "Your typical night life kind of place... though the music is nothing exciting the zomato gold offer is ! 😁 ... food is okay but preferably a lunch scenes works better in terms of taste rather than dinner when it gets really crowded.", "This place is located in indiranagar, this is pub having smoking and non-smoking zone, it also has DJ and dance floor. The interior is dark, dj starts at night and plays good number of songs for people to dance and enjoy.", "Came here for a Saturday lunch. The staff is very courteous, the food(both in terms of quality and quantity) is really awesome. We tried the fish and chips, chicken pasta and chicken sub along with virgin mohito. I suggest u book a table before your visit as the queue might be overwhelming.", "Been to The Black Rabbit for a team dinner. Love the St Martin beer that is on tap. Food is very very good. We tried some chicken wings, chicken lollipop, shepherd’s pie and pizza and everything was flawless. Lastly, with Zomato Gold, this place is rather affordable. Would go back for sure", "I've been here twice and my first time was absolutely amazing. The charcoal chicken appetiser and the bianco pizza were to die for! As it was a weekend, the place was jam packed with no tables available.", "I have been to this restaurant twice. Both experiences have been good. The staff is very courteous and they patiently explain the dishes and also give recommendations of their specials. The must try is the Au Gratin and the pizzas. I would give the ambience a 3/5, taste a 3.5/5, staff behaviour would be 3.5/5.", "I really loved the music they were playing and the food is also good. The reason why am I giving Black Rabbit, 3 star because of the service. We waited for almost 1 n half hour for the table. The place is small and coz of the crowd it becomes very congested.", "Been in the area for quite a while now. Situated on 100feet road, you can barely miss it."], "rating": "4.3/5"}, "https://www.zomato.com/bangalore/kazé-1-lavelle-road-bangalore": {"name": "Kazé", "location": [12.9652570236, 77.5964992493], "reviews": ["Went there on a Thursday evening and soon after office hours this placed got packed quickly. Plush interiors and gastronomic delight this roof top bar overlooks the city with great views. In the midst of the hustle bustle on Lavelle Road and Residency Road stands tall Kaze. They also have a seperate indoor space for during the  summers to relax in the air conditioning or organise your  party in complete privacy. Add to it, great service too.", "Kaze has been on my radar since the day it opened and I finally visited the place on Thursday for lunch. We had the entire restaurant for ourselves which is surprising given that the restaurants in Lavelle road are always crowded. We ordered a few house special cocktails, gyoza, dimsum and sushi. Full marks for presentation, however food and service were not upto the mark for the price they charge. It surely burns a hole in your pocket and the ambience doesn't qualify for a a fine-dine restaurant. I am disappointed!", "A+ for the food and sheer range of the liquor menu. Service leaves a lot to be desired and the ambience while beautiful, could be functionally improved.", "A new place in Lavelle road, it's located at 21st floor. The interior is decent could have been better and vibrant.", "Last month , Bangalore witnessed the opening of swankiest restaurant in the central Bangalore.  An elegant restaurant with a 360º view of best of bangalore , it has a al-fresco lounge area suitable for evenings in the lovely Bangalore weather with elegant bar that serves some of the exquisite drinks from around the world.\n                                                ...", "A rooftop, Asian inspired fine dining bar and restaurant with an incredible view of the Bangalore Skyline.", "和食を提供するお洒落なお店がレクサスの入っているビルの最上階にあると聞き下見でランチ時に往訪。２１階にあがると左手にオープンエアなパノラミックな風景、右手にはクローズなスペースで格調高いテーブル席がありかなり広い。肝心な料理は、残念ながらなんちゃって和食の領域を出ず、また値段も高い（一品400前後から2000前後まで。ビールが400から600。税抜き）。ちなみにラーメンの麺はソーメンであり、味というよりは雰囲気を味わいたいインド人や日本人以外の外国人向けか。見晴らしの良いバー使いとして、締めにカレー（メニューあり）で、というのが日本人には良さそうです。", "The drinks were by far the most aesthetically delicious drinks in town. The place is breathtaking! I loved all the sushis! The flavors were truly inspiring. I recommend all the appetizers. The main courses were weak. The thai curry wasn’t great.", "Must visit ❤️FOR THE VIEW 🌆🌇", "This is one of newest places that has managed to take Bangalore by storm. Love the food, the decor and the drinks- the cocktails are absolutely unique and tasty, leaving you wanting more. The food is fantastic - for asian fare, they managed to hit the Indian flavour bullseye. The only downside is the service, which could do with improvement."], "rating": "NEW"}, "https://www.zomato.com/bangalore/gillys-restobar-koramangala-5th-block": {"name": "Gilly's Restobar", "location": [12.933040471, 77.6147516817], "reviews": ["A place like this in kormangala is totally unexpected. Excellent ambience, the most patient and cheerful staff. Extremely cheap and yummy food. Awesome offers and the drinks are good too.", "This place is located right adjacent to the busy street of Koramangala so it's easy to locate.Do not picture the ambience without giving a try...it's exquisite!!", "Visited this place on a Wednesday.", "One of our usual hangouts few years back. Small place but with good feel and quotes posters around. Upgraded chain is in Kormangala near Sony signal. Still I have a good feeling about this place. Cheers.", "Loved this place. Visited a lot many times and must say food and service is commendable.", "Multi level pub, super crowded on Saturday evening. Had a hard time being allowed it, being close to midnight. Finally allowed in after some pleading because we had a visitor with us. Stayed till 1am. Massive crowd on the rooftop. Music, dance, good choice of drinks. Highly recommended. Certainly worth a visit. If you are late, make sure you reach a little before midnight.", "Im giving this place a 3 star rating mainly because I didn't really find anything different from all the other drinking joints around Koramangala or for that matter Bangalore.There is nothing wrong at all .... but nothing really stands out.Its a very large space. In door & out door seating.Service is decent. Food is average...nothing great.Prices are also reasonable. They've spent a lot of money on this place...its HUGE...ambiance is lively...but i'd want them to excel in their food...and up their service...for a 5 star rating.", "This branch is much better than the e city one.", "My frequent go to place.. awesome rock classic ballads .. fresh beer.. good crowd.. I really love the spicy beef over here...succulent n melt in the mouth.. service is quite prompt n friendly.. Robert , a great guy to talk to.. very prompt n apt service ... Made my rocking afternoon..", "Ambiance - 4/5"], "rating": "4.2/5"}, "https://www.zomato.com/bangalore/koramangala-social-koramangala-7th-block": {"name": "Koramangala Social", "location": [12.935398439, 77.6141575724], "reviews": ["Social, the name needs no introduction. Pretty famous in other cities as well, I was inquisitive for my first Social outing in Bangalore. The ambiance is pretty chilled out and relaxed. Being decorated with all sorts of indoor plants and glass top ceiling, this place offers a nice positive vibe. The indoor decor may seem a little  quirky and even the washroom walls are uniquely designed with stones. Social has also come up with a co-working space that they provide during the day so one can now attend extremely important meetings while hanging out with friends and family. There's a separate balcony area for smokers to chill and hang out even with your drinks in your hand.", "Love everything about this place. Awesome concept. Very relaxed ambience. Lots of green space this one has. Quirky and fun decor. Service is prompt and they are always ready to help. Food is great as well. Tasty and keeps you going for more. So a fun place to hang out with friends.", "Me and my friends went here on Weekday evening. The place is easily located. And they have parking too. The place looks beautiful with beautiful ambience with lots of plants and the walls are stones. As we entered we were welcomed well and showed us the place to be seated.", "We were very lucky to get THE TABLE admidst the Amazon jungle. Right above us was a high glass rooftop and even though we were surrounded by plants I couldn't spot even a single insect! And that's a relief.", "Location- 5/5 easy to locate. Though it is on the third floor, the name is vizibile from the road only.", "Just like every other social in other cities, this is also a best place to hang out. Great Food. Great Crowd. Long Islands. Perect place with buddies. The terrace floor is very enjoyable and rejoice. Capturing some great moments.", "The uniqueness of the menu was good and the combination of different ingredients blended well. It failed a 5 star because of the ambience. The seats were bad. They were that folding steel chairs and plates were cheap aluminum plates. they fool people to think its part of style. It isn't. For the ripped off price and service tax we pay they could have done it better.", "Awesome and grt experience of the place", "Food is average as far as quality and flavour is concerned.", "The ambience is Awesome! We sat in rooftop and the service was good.we ordered KitKat shake which tasted yummy.then we had corn nd veg biryani both of which tasted good.the quality of food nd the ambience makes it a must visit place."], "rating": "4.5/5"}, "https://www.zomato.com/bangalore/the-reservoire-koramangala-5th-block": {"name": "The Reservoire", "location": [12.9335142885, 77.6222622022], "reviews": ["Hep bar and ideal for sports screenings.", "The place is lovely and very lively! They have some great Spanish Sangrias and appetisers as well. Perfect place to watch a match as they have a screen on the second floor with a great view. I really enjoyed the nachos and the popcorn chicken.", "Visited this place on sunday night ....", "The Reservoire has newly entered the pub arena of Bangalore and going by its calibre, looks like its ready to lock horns with the big boys of the town in terms of becoming the go-to place for people. Bookmarked the place ever since it has opened and finally got to visit the place this Friday.", "It's a three floored restaurant, so the ambiance is extremely spacious but the lighting was dull.", "Located in the heart of koramangala, this place is quite big, spread over 3 floors with ample seating place. They also have rooftop bar which gives good vibes on cold evenings. The have a wide range of alcohol, slightly over priced cocktails though. The service is really good. Everything's served fast. I don't recommend this place for food though. Food isn't that great, but if you're to just munch on while you booze, it shouldn't be a big deal.", "The place has multiple seating options and the rooftop with a bar set-up is real convenient. The food was delightful, finger food options complemented drinks well.", "Ambience is great. Good service and friendly. Good food. Price is reasonable. Pizza was not so acceptable, the fish and chips tasted nice. .", "Went here with my team for an office get together and wasnt really thrilled. The industrial decor is something that catches your eyes however once inside the food is really a let down.Since it was an afternoon get together did not have any drinks but the soup ,salad and a few other starters I tried did leave a lot to be desired. The menu is confusing with a bit a bit of everything there and therefore seems like they are unable to hold it all together even though they make effort with regards to taste and presentation .The service is prompt and friendly.", "I definitely thought a place of this calibre will avoid serving stale garlic bread and soup sticks. The staff had a very nonchalant attitude. There were just two occupied tables and yet the service was beyond pathetic. We had to request several times and wait for several minutes for them to suggest serve us water."], "rating": "4.1/5"}, "https://www.zomato.com/bangalore/the-hole-in-the-wall-cafe-koramangala-4th-block": {"name": "The Hole in the Wall Cafe", "location": [12.9345668134, 77.6256136224], "reviews": ["It's a classic kormangla house converted into a brekkie café.", "The one stop solution for your breakfast/brunch fix in Bengaluru. The place is forever crowded; weekend-weekday irrespective. Try to reach by 8 am if you are coming on a weekend or be prepared for 30 - 45 min of waiting.", "Had been here couple of times. A very nice ambience which makes you feel like home. Tried their breakfast and almost all of their items in the menu. Liked everything, but their cost is quite high for the quantity they give. I also noticed that the quantity got lesser everytime I ordered.", "Love the Breakfast here.", "Ambience - 4", "A cute little place..loved the decor! The food was also really good..had the cheesy omlet which was so soft and melt-in-the-mouth...also had the pork meat platter which was yummy too!", "", "Cosy and lovely place with food made with love to start your day with... what more? Its pet friendly and you can often come across a kitten bullying your dog 😂", "It’s the best one for the breakfast and brunch as well.its a different experience there.slightly over priced,very good food and good service too.very nice ambience and good crowd also.", "I finally had my “Hole in the wall” meal! Peanut Nutella shake followed by the Smoked Mushroom sandwich, and topped by the Oreo pancake were the highlights of the fantabulous meal🤗"], "rating": "4.4/5"}, "https://www.zomato.com/bangalore/the-fishermans-wharf-sarjapur-road": {"name": "The Fisherman's Wharf", "location": [12.9144004339, 77.6665541902], "reviews": ["First off, loved the ambience. Gives you that \"Goan\" feel. Food-wise, the taste is good but the spread wasn't that great, and also I expected a variety of starters. The management needs to have more people co-ordinating the seating and reservations because we saw a lot of people waiting and then leaving in disappointment. Very poor management.", "Location 3.5/5", "After visiting this place I can say, one checked off from my restro list😋", "After moving to an apartment complex on Haralur road, Fisherman's wharf has become my go-to place for sea food.", "Great place to taste Goan food cuisine. The offer of happy hours is a added advantage. We had been to the buffet spread which is lavish.great taste and good spread which offers nice choice of both veg and non veg food. Will surely visit the place soon. Seating arrangements are made well where you get your privacy to chat or catch up with friends. Loads of wood works and boats kept as decor which adds to the Goan feeling.", "Just dash into this place of you are a sea food lover!", "After lots of recommendations from my friends I finally visited Fisherman’s Wharf. Recently I have developed taste for sea food and this place serves some mouthwatering sea foods.", "Finally visited the famous fisherman wharf.", "Had heard a lot about this place. Although we had gone after our dinner still we enjoyed a lot. We ordered french fries and a beer along with pomegranate margarita. The ambiance was great and the staff was also friendly. I would like to go the next time also and be there for a longer period of time.", "Amazing Place, Amazing Food, Amazing Ambience"], "rating": "4.1/5"}, "https://www.zomato.com/bangalore/hard-rock-cafe-st-marks-road": {"name": "Hard Rock Cafe", "location": [12.9760339362, 77.6015672833], "reviews": ["Finally I got a chance to visit this place. I have heard a lot about its ambience and live music. I must say I was really impressed. They created such an amazing setup. One can just sit, have a good drink, enjoy the music without getting bothered by the madness of the dance floor or let loose themselves on the dance floor, choice is absolutely theirs. The good rating is absolutely because of this.", "The ambience and the place is amazing . Being here is an experience by itself.Cyril, Shyam & atit were amazing staff. Really made this experience at hard rock amazing. Never would want to leave  this  place.", "Amongst the HRCs I visited between Mumbai & Bangalore, I would rate the one at St Mark's road a notch higher.Located inside a stone building its one of the most sought after gastro pub by young and old in Bangalore for sure.We could feel this by the queue outside while we were leaving and during our stay inside.", "Visited with friends and family. Frankly was expecting more. It was just ok. Servers need to tone down the attitude a bit food just about ok.", "Overall the experience was grt", "Hard rock cafe it really rocks! The ambience, service & food is excellent. Server over there really good suggestions very good! Enjoy over there on Saturday night.", "After a long wait, i visited this place as there was a concert of the band Euphoria here and i can assure you, it was the best place indoors that the concert could’ve been. The ambience of this place is bound to attract metalheads and any purists in taste of music.", "This place was on my bucket list from a very long time and I finally made it to here on a Saturday afternoon. Amazing ambience. Those people who love music, I am sure they would fall in love with the ambience of this place.", "Staff is awesome. Cocktails/liquor list are great. But I think the current playlist needs to change. This building used to house 1912. Or was it 1920. A great watering hole..anyway some trivia from times before. HRC food, like any pub food, is pub food...uninspired, non polar, meh. I love the place but yeah there's only so much a brand name can do for you. HRC over the world are pretty much the same I guess. How are you keeping up with the times though? The crowd, me included, lights up when the team members go for a jig on YMCA.... it's pretty awesome...I would say about 10 is a great time to start. The jig is usually around 1030, and about 1115or 1130 is when crowd starts thinning.", "A visit to the Hard Rock Cafe has been in my bucket list for a long long time and finally I had the chance to strike it off. Had huge expectations to say the least when I visited the place and it would be an understatement if I don't use the word dumbstruck to say how I felt when I entered. Classic 70s rock music playing in the background with an absolutely classic texture and ambience to the place. A rock fans heaven is how I would like to describe the entire structure. The whole building is covered with Rockstar memorabilia which covers the Beatles to Elton John's fancy rock suit."], "rating": "4.6/5"}, "https://www.zomato.com/bangalore/chianti-2-indiranagar": {"name": "Chianti", "location": [12.9699138441, 77.6403396204], "reviews": ["This turned out to be another case of overhyped place where we were tricked by the high ratings ! Ravioli was bad (I could not help but compare against smoke house). Funghi risotto was very average. Mocktail sangria had such little quantity. Sauteed mushroom were just ok. Staff is courteous and services were quick though. Valet parking is much helpful at this crowded spot.", "Amazing place to have Italian food in Bangalore. Superb Ambience, Courteous Staff and Delicious Food will give you a truly satisfying dining experience here.", "Chianti ( pronounced as K-ee-aan-tee) is a place in Tuscany region of Italy and is known for its red wine.", "Chianti, an Italian restaurant in a quaint street of Indranagar is an absolute delight and a pinnacle of Italian cuisine.", "It was raining that evening and we chose to dine in the good old Chianti! The spaghetti chicken and mushroom pasta was delicious, the grilled chicken with basil starter was yum and the highlight of the evening was the the prawns starter. Viola!!!!. The only let down was the Basa fillet with the shrimp sauce! I recommend they come up with a better sauce, something more citrusy and light! The shrimp sauce had no flavor and was slightly bitter! Overall, we had a great evening!!", "After longing to visit here since sometime, I got a chance last week to be at the Indiranagar branch. I would say, the place lived up to my expectations and almost justifies the ratings it has.", "Excellent Italian Food. The place is crowded due to heavy demand and suggest to do a table booking. They servr u complimentary warm house breads with food. One might enjoy a good wine too food, i dont enjoy wine so cant comment abt same. No other alcohol except wine is served here. The Restaurant manager personally was attending to all. In case one doesnot wanna pay service charge it can be requeste and they are happy to oblige. The staff was very cpurteous too.", "[Zomato Gold Visit] Hassle free!", "The ambiance is fairly decent. The outdoor is a little too cramped.", "The sangria was very good. We had a beef steak and lamb chops, both of which were well prepared. I wouldn't say that you are missing on a lot if you don't visit this place. But it's worth a visit"], "rating": "4.6/5"}, "https://www.zomato.com/bangalore/bombay-brasserie-indiranagar": {"name": "Bombay Brasserie", "location": [12.9701013828, 77.645868659], "reviews": ["Awesome food so much items to try. Please go empty stomach before you go and try this one. :-)", "A true gem in the heart of Indiranagar.", "I went to this place on the new year's day, so this review might be late, but the memory that this place created through its delightful food and decent service is still so fresh.", "Intriguing menu.", "Been to this place for dinner with my parents, and I think it’s absolute a family place, I really loved the interiors ...the place gave a rustic look with antiques giving that royal essence!", "Ordering food has become a pain in the ass with Zomato. They dont deliver and the you loose your money.", "There are a very few places which fits ones palette completely. Bombay Brasserie turned out to be one such place for me. I cannot rate this place any less than a perfect five. I don’t know about the cost but for me when you get out of a place with a smile and happily rubbing your tummy, it’s totally worth it ! Will be looking forward to it more.", "Been to this place for dinner with friends and place was quite crowded and we had to wait for 30 mins to get seated. The place was beautifully setup with indoor and outdoor seating with bar. This is a theme restaurant filled with antique items placed such as aluminium dabbas, old typewriters, telescope and couple of things, which brings nostalgia and makes people come back again. Coming to food we had veg starter Hyderbadi Subz Shikampuri it was not cooked to full, Chur Chur Paratha with Jaipur Kofta we liked this lot and Subz Biryani with raita which is less spicy compared to Hyderabadi biryani me being Hyderabadi didn't like it and mirchi Ka salan was missing and friend had Pathar Ka ghost biryani. Drinks were decent we had aam ki lassi, Punjabi namkeen lassi and lime water, at end bill came in old school dabba filled with mango bites nostalgia again. Overall we had good time with happy meal. I rate it as 2/5 for food and 4/5 for ambience and 3/5 service. Things to improve music was too loud it was disturbing for customers who like to enjoy meal with friends having good talk and prefer subtle music", "Great food. Great dining experience.", "Only thing negative about this place is , why is it so far away from my home so that I can't visit here more frequently !! Not much left to say after that , other than the food was absolutely delicious and the ambience was lovely . No complaints regarding the staff service . So if you love North Indian food and you wanna have a pleasant experience, do visit this place . ✌"], "rating": "4.4/5"}, "https://www.zomato.com/bangalore/big-brewsky-sarjapur-road": {"name": "Big Brewsky", "location": [12.912925929, 77.6829220355], "reviews": ["Totally loved this place,good beers,nice ambience for dinners,candle light dates,group get togther,nice weather and pool side dinner adds to it.Food options are good and taste is really best so far.must visit", "This is one of best brewing company which is located at Sarjapur Road, Bangalore. They serve fresh hops nice beers and you will have the good moments of your life with beautiful ambeince and you can try Pizza here along with 🍺. Hey I'm giving this reveiw very lately as I could not time ..Anyways have a pleasant time over there with Chilling beer", "Went to this place last year for a team party. We had a corporate package with unlimited food and drinks. They served 2 chicken starters that was really yummy. I don't try the veg starters but it looked nice. Food was customized based on our package so nothing great.", "Ordered a Prawn fried rice and a Kung Pao chicken and the taste was truly great. Generous servings of prawn portions in the rice and the Kung Pao chicken was rich, mildly spiced with the exact fragrant that it should have. Will tru the other dishes soon.", "Great comfort food! That's not even the best part... One of the few home grown micro Brewers in Bangalore, the cask's are a great sight as you enter the place! Nice fun ambience with a playful mood!", "They claim as being largest brew pub in Asia and that should be apparent as you enter this large place . There are two floors of seating with lush green surroundings that makes for an impeccable ambience. And if it drizzles you are in for a treat! There is a pool too for that perfect setting. Went there with my office team on a dinner buffet package . The mocktails were good. Paneer starter is average while cheese balls were good. Wasabi Jhaal muri is a decent try. But the show stopper was Tres Leches pastry which is the finest we ever had. Ended up ordering one for every one ! Staff is courteous but services need to be quicker.", "A mind blowing place , what an ambiance .. easily a bollywood movie can be shot here.", "This place did well overall , but the service is pathetic.", "Best ambience everrrrr. Best beer and good food. The staff is so friendly. The place is spacious giving you ample personal space. Definitely a must visit for all beer lovers in Delhi", "Nights and evenings are houseful for this place - which is expected from any good night club / restrobar. I was amazed to see waiting list at 3PM on Sunday afternoon. Hats off to its management to pull such crowd by their innovative style of delivering customer experience.  I remembered my party time in Goa - it is refreshing to see all guests along with happy staff in full party mood. Food is good, alcohol not as expensive, music is well regulated, fishes in the pond are well fed though the water in the pond can be cleaner, service is ok,"], "rating": "4.9/5"}, "https://www.zomato.com/bangalore/windmills-craftworks-whitefield": {"name": "Windmills Craftworks", "location": [12.9824129557, 77.7219793573], "reviews": ["The oh, so perfect brewery?? That's right! It's more than that. The beer is heaven in this place. Food was good and the service was excellent. The Persian kabab was one of a kind, do try it if you ever wish to kindle your taste buds with a whole lot of new flavours. Chicken wings were good and the creamy pasta was good as well. Didn't have space for dessert though! Coming back for that soon 😽", "Well what can I say about this place...it is heaven on earth especially if you are seated outside overseeing the greenery. Was there on Sunday noon and place was completely filled inside...when we stepped in we were little reluctant to take outside seating as there was no AC but the moment we stepped out to deck it was totally different experience. We settled at the table and quickly ordered some beer and starters. By the time beer arrived at the table it started drizzling and it was just perfect. The next few hrs we tried all the beers on house and were completely thrilled with the experience.", "\"Owning the night\"", "“Upmarket, sophisticated place with mature crowed serving nice F&B including Craft Beers!”.", "Wow what an ambiance!! I particularly liked the way of placing orders through tablets. That was something new and a much needed innovative method for this day and age. Despite this the staff was still courteous enough to check on us every now and then.", "The most famous bar in Whitefield. Certainly lives upto it's reputation. The ambience was just mind-blowing. The music, the lights, the seating and even something as subtle as air conditioning was so perfect and soothing, I wished more time could be spent there. There are shelves with loads of books at the wall. Outdoor balcony dining is also available. I just fell in love with the ambience.", "We were invited by friends to this place and had no idea on what to expect. Reached there with no expectations and on the entrance I was really surprised to see the place. Very rich, classy place , fine dine with a microbrewery. Amazing combination ! The staff is very polite and courteous. They gave good intro of beers and food.", "3.5/5. This is from my recent visit a month ago. I have known the place to be expensive and hence decided to go on a Monday to avail the all day Happy Hours. I also wanted to try the highly rated seasonal, the Mango Saison. The beer was good. However it resembled more of a Pale Ale than a Saison with high hoppiness and hence was not quite to my palate. I was not in IPA mood 😂. However after sipping this one you will burp Alphonso mangoes which does a bit in balancing out the bitter after taste . I chose a Hefeweizen for the next round and it was refreshing. The last round was a half pint of Stout which I did not find it to be very special. So the Dry Stout of Toit with the creamy head continues to be my favorite. My wife chose a Mango flavored Mojito. The drink was just okayish inspite of being priced at 600. Coming to the food we started with the Prawn roll and Pork Siders. The Prawn roll was outstanding. It reminded me of the Fried Prawns you get in Malabar, so homely 🤗. The meat in the Pork siders has almost zero fat which was a delight. For mains we picked Nalli ka Salan which was juicy and delightful. Full marks to the food. The service was prompt with the IPads and the waiter was also cordial. Coming to the turn offs, I did not like the dining table for the couple. It was too long for the people on opposite sides to have a proper conversation. The 2 seater tables are parallel to the 6 seater or 8 seater tables which are properly laid out. Perhaps this is a clear indication that they are looking to receive corporate teams than the regular couples. Well... Whitefield has options for the beer enthusiasts cum food lovers. Biergarten is not far away.", "It was a to do list for long and finally we made it on a Friday night we decided to visit the brewery instead of the terrace as we wanted some \"we\" time and ambience.", "Nothing much to add that hasn't already been said."], "rating": "4.6/5"}, "https://www.zomato.com/bangalore/the-druid-garden-sahakara-nagar": {"name": "The Druid Garden", "location": [13.0637409571, 77.5913433731], "reviews": ["Really good place to go with friends to chill..", "went during the ramazan time ordered the special mutton biryani ..liked it a lot..also ordered the kalamari fries..chicken starters..there was less option for beers from their own breweries but overall it was a good exp..the artificial turf in the open area was something which took us by surpise..also the service was good", "Life saver for all those who lives in north bangalore. Beautiful ambiance with sitting both indoor and rainproof shelter terrace.", "Food 3/5", "Start with the house beer & end with the house beer", "The place is huge and equally crowded. We started with the beer sampler tray which gave 7 varieties of beer that the place had to offer and they were all nice. In food we ordered the Veg Nachos twice and it was in sufficient quantity. The fries (potato something) came with a green chutney which was a nice combo. We also ordered a paneer starter which was well made.", "The Druid garden brings you different European styles of craft beer! The menu of Druid garden is curated in such a way that all the flavours in every dish come together in harmony. This one of the very few good restaurants located in north Bangalore.\n                                                ...", "I had heard a lot about this place and was looking forward to visit. I must say I wasn't disappointed after my first visit. The place is beautiful and the ambience is simply amazing, you literally feel you are inside a sophisticated garden. The food is good and so are the drinks and the brewed beer. The stewards are extremely polite and they serve you continously with a beautiful smile on their faces. The place is quiet expensive and not at all pocket friendly. Overall a great place and a must visit in Bangalore.", "Beautiful place and awesome food.", "This is located above haute fitness and it’s a very big restaurant. I didn’t like the theme over there , it had so many reflectors and it was a little hot over there. It says it’s a garden themed restaurant but didn’t feel that way. The tres leches is a must try and it’s so good. Onion and molten , smoked chicken sandwiches were fine but this restaurant is a costly one."], "rating": "4.2/5"}}