{"https://www.zomato.com/bangalore/truffles-koramangala-5th-block": {"name": "Truffles", "rating": "4.8/5", "location": [12.933426714, 77.6143838838], "reviews": ["Near to forum mall... it is one of the best place to hangout with family and friends...", "Truffles is a place where you get Wide Varieties of Burgers and it is one of the Best Place for Burgers in Bangalore.", "Ambience - 5", "A short distance away from Forum Mall and Christ college, this place is a popular joint for college students. Around the time I joined college, the place was smaller but soon expanded. But such is the popularity of this place that even after expansion you would always find a crowd waiting for a table around this place. Their All American Cheese burger, sloppy joe, tex mex, American breakfast, lamb burger etc were very popular. The only complaint I’ve heard about their burgers/sandwiches is that they put boiled egg instead of the fried one in the non-veg club sandwich. Portions are huge and many struggle to finish the burgers or pasta when a couple of starters are also ordered. So choose wisely from the differing size of the portions on offer. The youngish crowd frequenting the joint can be a bit too loud and may not be to the liking of the older clientele, but the food is worth this hassle.", "If you've been saying no to this place looking at the crowd outside, think again! It's totally worth the wait. The burgers and sandwiches are great here. Do try the 4 cheese pizza.", "Crowded cafe, difficult to get a seat but if you do u vl forget the loooong waiting time with the first bite of the food. Have tried Pasta Agli-e-olio, Rosemary Chicken, Blueberry Cheesecake. All three items tasted well and quick service with proper portion size.", "Been here multiple times. One of the best places in Bangalore. Good setup, quick service, friendly staff and most importantly awesome food. Would visit more often, if only it was less crowded.", "This is a beautiful place located at Koramangala 5th block, almost near the Forum Mall. This place is reputed to be crowded at all times, with long queues for seating. And since we went on a Sunday, so crowd was expected. So from the beginning, the waiting area has mists spread to help the waiting crowd get a relief from the heat.", "The restaurant lived upto its hype. The food was worth the wait. Ambience is absolutely amazing. The burgers are something you must try and the desserts are not so bad either with reasonable prices.", "Truffles is a place where you get Wide Varieties of Burgers and it is one of the Best Place for Burgers in Bangalore. Service is quite Quick."]}, "https://www.zomato.com/bangalore/hoot-sarjapur-road": {"name": "Hoot", "rating": "4.3/5", "location": [12.9141419387, 77.6785051078], "reviews": ["Went to Hoot after a friend's suggestion- quite a big place and nice ambience with water and a boat in the middle. Plus point they serve hookah as well.", "The pool wasn’t looking similar to what’s shown in the profile picture , however I still liked the ambience. Sitting arrangement is of all metal chairs ( FYI). The 3 chicken legs were too good , pls do order if you visit . Followed by chilly chicken which was good and then lollipop which was alright. The staff was super busy so the service had to suffer . 3 pax 8k bill with alcohol had rs.800 service charge which wasn’t worth.  I requested them for waiver it... first I was politely refused but then they removed it and we paid necessary tip by cash.", "This one was long overdue, pretty famous in Sarjapur and I remember the time when getting a table here was a pain.", "Hoot", "Starting with the ambience its amazing I just loved it. The feel of the place is so uplifting. And I loved the taste of the food which i did not expect to be this great though i heard a lot about this place from my friends. Would love to visit this place again.", "Came here on a weekday.. pretty empty and ambience was not great . Music was sad . Food was good . But not happy at all after visiting with all that hype", "When we heard about another Microbrewery opening up in Bangalore, we couldn’t wait to try it. And Hoot sounded extremely promising. Located in Sarjapur Road, Bangalore, the brewery is not hard to find at all just left hand side of the main road.", "It is one of those places which will leave you mesmerised. So many people. So much booze. Such great music. And, a beautiful ambiance. This place can take someone's heart away.", "Hoot offers unique ambiance and spend great music at their place. Generally packed fully and hence becomes highly difficult to get table. Service is something that could be worked on. If not the best micro brewery but definitely one of the better brewery in Bangalore.", "Ambiance 4🌟 - First thing anyone notice and enjoy about any place is ambiance and I would rank hoot very high on ambiance. In the weather like it is humbly windy best place seat is in outdoor so do I was seating on 1st Floor so could see the ground floor as well. Loved the ambiance of the place best part is water canal made in the centre of the cafe on ground floor and having wooden boat in it....wao and on top of it having bar counter next to it so I could see bar tenders showcasing their skills while making drinks for people....amazing."]}, "https://www.zomato.com/bangalore/big-brewsky-sarjapur-road": {"name": "Big Brewsky", "rating": "4.9/5", "location": [12.912925929, 77.6829220355], "reviews": ["This is one of best brewing company which is located at Sarjapur Road, Bangalore. They serve fresh hops nice beers and you will have the good moments of your life with beautiful ambeince and you can try Pizza here along with 🍺. Hey I'm giving this reveiw very lately as I could not time ..Anyways have a pleasant time over there with Chilling beer", "Went to this place last year for a team party. We had a corporate package with unlimited food and drinks. They served 2 chicken starters that was really yummy. I don't try the veg starters but it looked nice. Food was customized based on our package so nothing great.", "Ordered a Prawn fried rice and a Kung Pao chicken and the taste was truly great. Generous servings of prawn portions in the rice and the Kung Pao chicken was rich, mildly spiced with the exact fragrant that it should have. Will tru the other dishes soon.", "Great comfort food! That's not even the best part... One of the few home grown micro Brewers in Bangalore, the cask's are a great sight as you enter the place! Nice fun ambience with a playful mood!", "They claim as being largest brew pub in Asia and that should be apparent as you enter this large place . There are two floors of seating with lush green surroundings that makes for an impeccable ambience. And if it drizzles you are in for a treat! There is a pool too for that perfect setting. Went there with my office team on a dinner buffet package . The mocktails were good. Paneer starter is average while cheese balls were good. Wasabi Jhaal muri is a decent try. But the show stopper was Tres Leches pastry which is the finest we ever had. Ended up ordering one for every one ! Staff is courteous but services need to be quicker.", "A mind blowing place , what an ambiance .. easily a bollywood movie can be shot here.", "This place did well overall , but the service is pathetic.", "Best ambience everrrrr. Best beer and good food. The staff is so friendly. The place is spacious giving you ample personal space. Definitely a must visit for all beer lovers in Delhi", "Nights and evenings are houseful for this place - which is expected from any good night club / restrobar. I was amazed to see waiting list at 3PM on Sunday afternoon. Hats off to its management to pull such crowd by their innovative style of delivering customer experience.  I remembered my party time in Goa - it is refreshing to see all guests along with happy staff in full party mood. Food is good, alcohol not as expensive, music is well regulated, fishes in the pond are well fed though the water in the pond can be cleaner, service is ok,", "Just awesome..."]}, "https://www.zomato.com/bangalore/toit-indiranagar": {"name": "Toit", "rating": "4.4/5", "location": [12.9792037004, 77.6405562088], "reviews": ["Toit is located right in the beginning of indiranagar, has a very unconventional build, you can taste the freshly brewed beer, it is fairly priced and a great place for beer lovers to enjoy the fresh beer which is heavenly.", "One of the best places in bangalore for craft beer.", "The food was excellent ... service awesome ... Can't believe  I didn't know about this restaurant. Thanks to a friend I do now", "Went there on a Saturday evening, it was around 7pm when we reached so didn't bother to do prior booking. We were so wrong! The place was already full, all 3 floors of Toit. Prior booking is highly recommended.", "It completely lives up to it's hype maybe even more than that.", "Great pub, nice ambience and superb location", "I can't think of a reason why I didn't write a review for toit despite having visited this place numerous times since it began.", "Though rated so high in this place is no value money and this place is recommended ppl who want to the big crowd that's was famous I have been their for so many time only for the beer but this time is very worst I would not recommend to any of frnds becoz the service was the worst part and even the AC could be better wre I was not able to breath also. .. plse try to do something it", "I know my low rating is going to raise eyebrows since Toit is one the most popular hangouts in the city. I’ve been here a few times years ago and had good times over cocktail pitchers and wood fired pizzas (which frankly, I have no memory of 😜). But sadly the last time I visited, which was last weekend, wasn’t such a great experience.", "If i had to describe the place in one word: Congested"]}, "https://www.zomato.com/bangalore/meghana-foods-koramangala-5th-block": {"name": "Meghana Foods", "rating": "4.0/5", "location": [12.9344913298, 77.6162040979], "reviews": ["Out right one of the best chicken biryani I've had with no compromise on the taste in a take away ! MUST have meghanas special chicken biryani...it's delicious !!", "Boneless chicken biryani... Recommended", "Meghanas was a favourite haunt for those of us who studied in Christ for their delectable Meghana Special Chicken Biryani. The boneless biryani is full of flavour and the portions are huge. I’ve on occasion tried their paneer biryani, chicken 65, mutton pepper fry and chicken kebabs as well and all of the above taste good. But  what takes me back to this popular food haunt every time I visit bangalore is their yummy full of goodness biryani.", "A small place which serves food till late in the night. So if you were partying hard and forgot to order food it is the place for you.", "Meghana foods , this particular restaurant has one of the best Andhra style food in this city . As a pure vegetarian i just love the Allu Dum biryani , phulka with paneer butter masala & Green peas curry. And dont forget about the starter’s they do make it spicy .", "Even though m sick of having rice daily from the day i came to bangalore, i went to this place. Famous for biryani, and i got to know why it is famous.", "Best place for biriyani in Bangalore. Ordered two biriyani and two appetizers for four people and we kinda struggled to finish it. The Paneer biriyani costed more than the special chicken biriyani , but both were really good. The only disappointment was the chilli fish, it tasted very very average.", "One of the famous and  busiest tasty n spicy biryani outlet located in Koramangala.", "I had ordered food from this place via some delivery app. Every item was tasty and perfectly cooked as it should be. Would love to visit this place for more Veg items. Biriyani's are always great here with quite good quantity. I am in love with Dum Biriyani.", "I had gone to this place on a Saturday afternoon and had their special biryani. To be very frank it was just, there was nothing so special about it. And the ambiance of the place was not good."]}, "https://www.zomato.com/bangalore/communiti-residency-road": {"name": "Communiti", "rating": "4.3/5", "location": [12.9722191879, 77.6083690301], "reviews": ["Nice place to hangout in the evening. Fiery chicken pizza was fab in taste. The devilled egg dish was something very unique and tasty too. Only thing I wanted was a bit more of variety in the menu. Otherwise its a perfect place for hangouts.", "Great place to hang around with your friends. Went here yesterday and wattay cosy ambient set up. Food was amazing too chicken tender must have. Bolognese pasta and drinks were good too. Since this is a pet friendly place would love to bring my pet and have some great time in here. Hats off to the management for being quite organized", "Looking for a place to chill with friends , this is it. Good options in food & drinks (cocktails). Location is perfect & the  place is pretty big so getting a table isn't difficult. Got their price points right as well.", "Recently visited this place for dinner and here is my review:", "Communiti is a place suitable for all types of crowds . This place has been in my frequent visit list. The ambience of the place is nice , dark and pleasant . The food here is really nice , their BBQ chicken wings and the peri peri chicken appetizers are nice and also their brick oven thin crust pizzas are really nice . Coming to the drinks , I'm in love with this one cocktail here called tequila sunrise , it's really nice and simple with not too many flavours playing around , other cocktails like the screwdriver , s*x on the beach are nice too, other drinks like their in house brewed beers are nice (do give them a try you get a taster palate) . The staff here are well trained and quickly respond . Overall this place is a go to for casual hangouts and you'll surely have a nice time here", "Truly a “communiti” bar! Good Belgian Beer accompanied with Hummus/ Lavash..Service was pleasant too! As a Hummus/ Pita bread fan, I would recommend adding Pita Bread to the menu👍", "Good location. Beer with good enough choice to choose from. Good food. Friendly staff. Will recommend to get reservations in advance. It use to be crowded on weekends.", "We had a nice time with friends. Ambience was super cool with awesome music. I was impressed by their brews. Their service was super quick. Shall visit this place soon.", "We group of 6 friends visited here on last Sunday to celebrate birthday and watch IPL finals. Ambience of this place is unique. Entry gate is like home one with small blackboard outside mentioning - 'We are Open/Closed'. Sculpture of 3 laughing kids at the entrance is one more attraction of this place. Plates printed with commmmmmmmmmmmmmmmmmmuniti, small hanging bulbs on the table and various other things make the ambience of this place really great and unique.", "I have been here before . Staffs here are friendly and nice service is also good we ordered beer samplers and mocktails(mango maniac ) both were good . Even sandwiches and burgers were delicious. The ambience here is great"]}, "https://www.zomato.com/bangalore/burma-burma-indiranagar-bangalore": {"name": "Burma Burma", "rating": "4.6/5", "location": [12.9705130526, 77.6447129622], "reviews": ["Great Place for Veg and Vegan food. Lot of waiting even at Lunch time as they dont accept bookings on phone", "After reading through fabulous reviews of this place and waiting for nearly 45mins, we managed to get a table on a super busy Saturday night. The place takes reservations till 730pm on weekends and after that it is all upto your luck. The interiors are very nicely done up with great ambient lighting. Now for the food review: we ordered the highly recommended Samosa Soup for starters which was this tangy tomato based broth with samosa pieces submerged in it. We enjoyed the soup thoroughly. Next we went for the crispy lotus stem which was a brilliant snack that you could just eat the whole day. Who would have thought that crispy fried lotus stems with a spciy masala on too would be so addictive! We also had the masala potato steamed buns which were nice and soft and well flavoured. Ended up the main course with Burmese Falafal which was one of my favorite dishes for the night. Subtly flavored falafel in a beautiful Garlic sauce, it was super tasty!", "Burma Burma : Nice entrance but the quiet outside belies the full house, vibrant inside. It is a small space, so well done and impressive that it does not occur to us that it is in fact a small space. Good for them as the place looks full and gets buzzing quickly. Burma reminds of Burma Teak and this place while may not be BT, has a woodsy look.", "We went there on a Friday afternoon for lunch and there was a wait for beyond 20mins. Quite unexpected for a Vegetarian Restaurant.", "So, Burma Burma is a vegetarian restaurant that you'll most likely find packed even on a weekday. People are literally thronging outside this restaurant and you can surely expect a waiting time.", "Amazing food !!!", "Burma Burma is a place that serves par excellence food in every course. Amazed to see how creative they could get with salads, noodle dishes, curries and bubble teas. Interiors are refreshingly honest and a perfect blend of traditional burmese look meeting modern lines. Burma Burma is definitely a restaurant that deserves to be visited again and again.", "Good ambiance. Quiet expensive .All the items are really unique in taste . I happened to goto this  place today with my colleagues. Everyone had a good time.", "A country with a stormy history, decades of oppression from the British and then ruled over by the military, has reduced Myanmar to one of the least developed countries in the world. However, the recent change in regime to a democracy is slowly bringing Burma back into the fold of world activities, and Burmese cuisine is being appreciated the world over.", "Fabulous first time experience."]}, "https://www.zomato.com/bangalore/brooks-and-bonds-brewery-koramangala-5th-block": {"name": "Brooks and Bonds Brewery", "rating": "3.9/5", "location": [12.9342338357, 77.6234309748], "reviews": ["Overrated. Service is pathetic. Staff not at all helpful while getting a table. They forgot to apply Zomato Gold discount on the bill. Beer is mediocre at best. Most other drinks are not available.", "This place is just awesome! If you’re making 2 visits in a weeks time, this tells a lot how awesome this place is. Totally not expensive, amazing view from terrace & lovely food with great brewed beers!", "Awesome food and even awesome cocktails!! Ambience is really nice , especially the roof top. This is really good for couples. The lower floor is good for friends who wanna hang out and also see the match screenings.", "This is one of the latest entry into brewery scene in Bangalore. This pub is located in one of the most party goers place in Bangalore. The drinks are very good, especially the brew variants hefe weizen and mango cider. We had pizza, chicken steak, pasta and few chicken starters. Apart from the steak other foods were tasted very blank. The ambience is very nice. The service is very slow. Overall an average experience.", "Eagerly waited to check out the new brewery in Bangalore, but utterly disappointed with the service. The wait staff were roaming around here and there, and did not pay any heed to our order or requirements. Towards the end, one of them mixed up the order and instead of rectifying, he started being aggressive and refused to correct the order until we finally sorted it with the manager. Heard a lot about the place, but the staff needs to be trained to pay more attention to the customers. Although, the beer wasn’t a disappointment.", "This is one of the most coolest brewery in Bangalore. 2 floors, and each floor has an inside and an outside seating area. The place serves one of the best Mango Cider beers I've ever had! It was so so delicious.", "Visited this place recently nice ambiance and good crowd though it was a weekday visit and they serve good breweries if you are going do try mango flavoured one that is good as they also suggest the same food is also good more importantly it’s cheaper compared to other places over all a thumbs up for this place", "Loved the ambience and great food. Specially the beer. It's the only brewery which has 8 beer on tap and such a strong mango cider which is my favourite. You guys should definitely try it out. It's extremely refreshing yet very strong. Great service and good music. Great for office parties too as it has a great spread out place. It's the next big thing in town and you all should try it out.", "This happened on one of those days when I could actually beat the rains in Bangalore. I reached the venue right in time when the rain started! So for a change, it did not get me..", "I tried all brews"]}, "https://www.zomato.com/bangalore/biergarten-whitefield": {"name": "Biergarten", "rating": "4.5/5", "location": [12.9824459531, 77.708532773], "reviews": ["Ambiance and food was good!! Went for team party!! Ordered veg and nonveg platter!! I ordered watermelon basil lemonade.. and had few veg snacks!!", "I always recall this place for their good portion of appetizers. Combined with the happy hour menu, it's a good place to be in.  Loved the pork belly and the sausages. It's unfair to rate this place  as 3 but not fair to rate 4 as well. For me it's a 3.7ish not because I didn't like the place but because I've been to better ones. I do recommend visiting here for a nice evening spent.", "\"Aptly Named\"", "Amazing place!! Loved the ambiance nd the food was great too!!", "Great food and drinks. Must visit. Service is good. Nice ambiance, so go and relax with beer. Wheat beer is best. Cocktails were good too. Ordered few non-veg dishes, chicken and prawns, all were delicious. Place is crowded on weekdays too. Overall nice experience.", "Biergarten is one of our favourite place to hangout with friends.", "Nice ambience. Very friendly and courteous staff. Loved it! The food is really awesome. Especially the pizzas and the chilli chicken.", "Had really high expectations from this place but it wasn't up to the mark for me. The beer was decent but the place needs to be maintained better. Also, I went in an afternoon so they had buffet and had nothing else but French fries for a la carte, which was bizarre if you are the just for some drinks and snacks.", "Liked this place.it has this nice ambience..dint like the spring roll much.cheese garlic bread was nice too..sangria was jus okay.ambience is pretty gud here", "Great place to have beer and thier wheat beer is must try."]}, "https://www.zomato.com/bangalore/koramangala-social-koramangala-7th-block": {"name": "Koramangala Social", "rating": "4.5/5", "location": [12.935398439, 77.6141575724], "reviews": ["Social, the name needs no introduction. Pretty famous in other cities as well, I was inquisitive for my first Social outing in Bangalore. The ambiance is pretty chilled out and relaxed. Being decorated with all sorts of indoor plants and glass top ceiling, this place offers a nice positive vibe. The indoor decor may seem a little  quirky and even the washroom walls are uniquely designed with stones. Social has also come up with a co-working space that they provide during the day so one can now attend extremely important meetings while hanging out with friends and family. There's a separate balcony area for smokers to chill and hang out even with your drinks in your hand.", "Love everything about this place. Awesome concept. Very relaxed ambience. Lots of green space this one has. Quirky and fun decor. Service is prompt and they are always ready to help. Food is great as well. Tasty and keeps you going for more. So a fun place to hang out with friends.", "Me and my friends went here on Weekday evening. The place is easily located. And they have parking too. The place looks beautiful with beautiful ambience with lots of plants and the walls are stones. As we entered we were welcomed well and showed us the place to be seated.", "We were very lucky to get THE TABLE admidst the Amazon jungle. Right above us was a high glass rooftop and even though we were surrounded by plants I couldn't spot even a single insect! And that's a relief.", "Location- 5/5 easy to locate. Though it is on the third floor, the name is vizibile from the road only.", "Just like every other social in other cities, this is also a best place to hang out. Great Food. Great Crowd. Long Islands. Perect place with buddies. The terrace floor is very enjoyable and rejoice. Capturing some great moments.", "The uniqueness of the menu was good and the combination of different ingredients blended well. It failed a 5 star because of the ambience. The seats were bad. They were that folding steel chairs and plates were cheap aluminum plates. they fool people to think its part of style. It isn't. For the ripped off price and service tax we pay they could have done it better.", "Awesome and grt experience of the place", "Food is average as far as quality and flavour is concerned.", "The ambience is Awesome! We sat in rooftop and the service was good.we ordered KitKat shake which tasted yummy.then we had corn nd veg biryani both of which tasted good.the quality of food nd the ambience makes it a must visit place."]}, "https://www.zomato.com/bangalore/abs-absolute-barbecues-marathahalli": {"name": "AB's - Absolute Barbecues", "rating": "4.5/5", "location": [12.9497983, 77.6993079], "reviews": ["I remember the day it was 2nd june,my birthday. I went there buffet.", "This chain of restaurants are my all time favourites. I always would like to revisit this place without any second thought. In simple words, its the most comfortable spot to have delicious food with friends and family on any occasion.", "Obviously a good food restaurant. But after 4-5 visits I found this place like a fish market. Kind of no privacy. Too much noise. But just for the BBQ this place is still on top of the list.", "Went there on a Thursday evening with office colleagues. Booking is recommended as the place got almost filled by 7 only. It was on my bucket list since a long time back.", "The place is good and the staff is also approachable. Booking table is advised . Now coming to food . The non veg buffet was pretty good, specially fish and prawns. The other menu was nothing that great. The dessert are on the ok side. One suggestion if you have a person who eats non veg but planned to eat veg on that day make sure he does not eat a single piece of non veg that day as the management will charge his plate under non veg. This happened to us.!", "It's a great place to try different varieties of non veg. Starters are amazing and they are the best non veg buffet restaurants chain in Bangalore. Recommended.", "The hype around this place was big. It did live-up in 2 aspects - very friendly staff and a varied menu. The food itself was not very good. While us vegetarians did suffer lack of options and were to console ourselves with weird dishes even the meat eating friends were unhappy due to not-so-fresh meat and a salty biriyani.", "The best place for Hangouts I have ever been in Bangalore since I am here. I have experienced its food, beverage, ambiance and the most important Service ; and i found it nowhere except this place. And this has been made me to be there for 7 times till now in last 4years.", "As usual the place is always crowded. Not much for vegetarians though, but can't blame them as bbqs are not meant for vegetarians. Good ambience but its congested a bit", "Been to the branch in Chennai before, and this is my first experience in Bangalore!"]}, "https://www.zomato.com/bangalore/the-london-curry-house-race-course-road": {"name": "The London Curry House", "rating": "4.2/5", "location": [12.9852596, 77.5793067], "reviews": ["They don’t accept advance booking so you invariably have to be in a queue on weekend evenings ! Thankfully there offer valet service. After the wait, we were ushered inside to a nice green ambience but it’s very crowded and cramped inside . So it’s a task to reach ones table. It may get hot outside though there are pedestal fans. Coming to food, I did not like as it’s way too oily. Pani puri wasn’t good and the batasha was stale. There wasn’t anything great about mocktails or main course either be it malai kofta or paneer. Services were ok.", "This place is one of the best take away place.Yes I say again “TAKE AWAY”.Went to Curry house on saturday evening for the first time and learned self service.First this restaurant illegally put a board outside that they charge Service charge of 6% which is obviously not clearly visible while entry, you only see it while exiting after paying service charge .Food is good and presentation is awesome.Ambience is very good with soothing lights.But service is the worst , I was doing self service and Bar ...now that’s the place to avoid here.Pathetic Bar tenders with zero knowledge of liquor.Worst part is staff , first time in my life I had bent down and request waiter to just leave us alone as we didn’t want to create any ugly scene with families on board.", "One of my office colleague have been talking about this restaurant whenever we were visiting Bengaluru. So this time we got time to go there for dinner. The place was super packed. So I didn't take a minute to understand that the food is good. When I looked at the menu card, I realized that the dishes were not the regular dishes but lot of creative preparation. When we got our ordered dishes services I realized even the style of serving was also very creative. The restaurant is a pure veg restaurant.  All in all wonderful experience and good food. Will be back again as there are lot of dishes on the menu card and want to try most of them.", "A crowded British themed restaurant in the heart of city. Absolutely loved the ambiance. Food was excellent although service could have been better. The spread comprises of European foods with an Indian touch which is unique. Try pani puri and cooker ki biryani.", "Have visited London curry house multiple times and the place is always jam packed.", "This place, hands down, offers the best food in the city. I have had my fill of exploring restaurants across Bangalore and nowhere have I experienced such food concepts, such presentation and such taste. I usually refrain from giving a perfect score to a restaurant but The London Curry House deserves it.", "Brilliant place for vegetarians! Good ambience , good food , decent pricing. A new twist to indian cuisine , nice place for a family outing.", "A must visit place for vegan cuisines!", "What a wonderful find! We went there for lunch. This is a vegetarian place but the variety offered is amazing. For staters we had patrani paneer and pani puri. Beautiful presentation! The paneer was super fresh, pani puri came with multiple fillings to make as per taste. Loved the food. We were quite full with the starters so ordered only one main, which was the sizzler, it was very yummy. The quantities are huge, so be careful while ordering. This is a great place for pure vegetarians. Will definitely go again. The staff is courteous and helpful. Had a great time!", "I have no idea why this place has such a high rating on Zomato. The ambience is frankly just alright - it was extremely noisy IMHO. Service was terrible. There were a couple of times I had to walk up to the kitchen or bar to get the waiter's attention and ask him to come over to our table. They served us our appetizers but there was no cutlery at the table and we had to wait another 5-10 minutes for them to bring us the cutlery."]}, "https://www.zomato.com/bangalore/flechazo-marathahalli": {"name": "Flechazo", "rating": "4.5/5", "location": [12.974443158, 77.6973469555], "reviews": ["Went to this outlet which is near to my office for lunch along with my office colleagues, my first impression was not good since it was just above Nissan showroom and it was kind of in a corner and not on main road and I had never heard of it but as soon as we entered the restaurant all my perception went to drain.", "This restaurant is always crowded,but when it comes to food one will come to know why it’s crowded. So delightful ambiance and quick service. One can make their own pizzas, n number of tasty desserts along with main course 😊must visit place with friends ,colleagues and family", "It has a bright colourful interior. A bit congested to move around in buffet area and very noisy. Hospitality was good. Starters Veg variety was good. Paani Puri counter was innovative. Rest of food was up to the mark. The important point is it’s all good value for money here, found it not too harsh in the wallet for the quantity of food and ambience, good place to take extended family and friends for an occasion.", "Went there yesterday with my office colleagues. Restaurant is little crowded and it took around 10 mins to get a seat despite pre booking.", "Flechazo is located on Doddanakkundi on the outer ring road near to Marathahalli. It also has got ample parking space so you dont have to worry about the parking. In case, if you are visiting on the weekend please make sure you book the table in advance as the place will be crowded.", "The experience for buffet dinner was great. The stuff were very enthusiastic to help and guided the right choices of food. The interesting things were make your own pizza and the starter conveyor. The location is a bit odd but still can be figured out easily from main road.", "I choose this place by seeing the food menu and the photos of the ambiance on Zomato. But when I actually went there for lunch with my team I was amazed and surprised at the same time that how they are serving such good quality food in such low prices. This place is good for team lunches and the one who loves buffet.", "Spreadwise this place has good variety, viz. soups, chaats, dimsums, shawarmas, sushis, kababs, pizzas, pastas and what not to start with! We went on a Monday for a nonveg buffet @566/- at 2 p.m. and the place was full packed with people even waiting outside! Our table attendant Ashish gave a commendable service with some customised dishes served on table even within the rush around. They served welcome orange mocktail and after lunch complimentary Mojito too. The chicken biryani in main course was the best I had in any buffet so far. The mutton was a bit hard though. Only downside was some of the food items like dimsums, jalebis were cold or replenished quite late and people had to wait for quite some time even for getting dessert plates or spoons. Also we felt the waiters in a bit hurry naturally because of the rush but if this can be improved then nothing better.", "One of the finest buffet place in Bangalore.", "I went to this place for a team lunch. Tried their buffet. Good variety of food both in veg and non veg. The starters were good. But some were not hot. The desserts were really good. They have live pasta and nitrogen ice cream counter. Ice cream was really good. Service was good. Food was ok."]}, "https://www.zomato.com/bangalore/byg-brewski-brewing-company-hennur-bangalore": {"name": "Byg Brewski Brewing Company", "rating": "NEW", "location": [13.070964, 77.651618], "reviews": ["Its much more bigger than its NAME!!", "Wow .. A humongous place to stroll around with your drinks, do a little catch up or just sit by the bar and overlook the beauty .. The reservation deck did create a little problem as we entered.. We had a friend inside who had a table but the lady asked our friend to come out n get us. Only then would she let us in. The service as of now is not upto the mark. The waiters are ignorant of what drink is getting served. Some of the areas are not yet operational and their brewed beers wouldn’t start till September. With a little here and there initial technicalities , this place is booming. The area and the ambience is amazing. Food is good and reasonably priced.. Very excited for them to be in the neighbourhood..", "A wonderful place, a pleasant change to the landscape of Hennur , wonderful food , amazing cocktails, Brewery is not running yet,can forget sangam 😂,", "It's BYG, literally. From outside it might look like a big old shed but wait until u make your entry. Various levels of sitting arrangements with Maximum no. Of occupancy any pub can offer. In house Brewery is yet to open. Live music, poolside table's, friendly staff, service was little slow though. Good food. Prior reservation a must. Would like to visit once brewery are up and running. Below are few pics capturing the vividness of the place.", "Please stop sending Promotional messages , Giving ads in mass media & Making statements such as “Asia’s Largest Brewery “", "There is one thing I can tell you , that this place is gonna be totally RAD & happening once it's in full glory . That being said please avoid this place until 1st July 2018 , cus it's so freaking huge that they under-estimated how though it's gonna be to handle this place on the weekends with out the full staff.", "2 is for ambience.", "Pathetic experience... order something you get something else and you pay for something else... menu price and billing price don’t match.... no customer service.. they generated bill for something which I didn’t ordered... luckily I checked the bill...", "1. Built in over 1.5 acres of land", "One of the best place I been to lately... Fab ambience, good food, good drinks, really nice, friendly staff. We went out in a sat night place was full but still good a good service n me n my gang are definitely coming back again n again... Suggest everyone to do visit once..."]}, "https://www.zomato.com/bangalore/big-pitcher-airport-road": {"name": "Big Pitcher", "rating": "4.5/5", "location": [12.9601005379, 77.6468677819], "reviews": ["This was my second visit to Big Pitcher. Its a nice place. The food is good. Their brewed beer is also nice. The dance floor is in the 4th floor for which there is a cover charge of Rs.1000 per couple which is redeemable inside. The dance floor is big but it was very very crowded, maybe because of a saturday. They play Bollywood songs on Saturday night. Overall a good experience.", "I visited this place on my very first trip to Bangalore. And what an amazing experience it was. It was a bollywood night and the dj was superb. One of the best dance floors I have been to. The next time we went in search of some north indian food. Well it stood upto the expectations.", "After hearing a lot about this place, finally decided to experience it first hand. You are never to miss the rocking facade of Big Pitcher when passing through old airport road.", "To my utter amazement, this place turned out to be a stunner. From food to ambience, and from service to music.", "Great food and beer. I had a great Saturday afternoon with my friends. Very courteous staff , special mention for Sahadat, who was extremely attentive throughout ... the prawn starter is to die for...Keep up the quality of food and services, Big Pitcher! :)", "Brewed beer ,hot starters and rain defined my evening at Big Pitcher ,I guess this is the first time I went that far from my place to get beer !", "Big Pitcher = Big Satisfaction", "I had the wonderful opportunity to change my disappointing experience in Big Pitcher with an amazing one and I couldn't be happier.", "I have been for the lunch it was a awesome day for me spl thx to the big pitcher management", "A true meaning to the word terrible, this place managed to disappoint us in every way possible. We had been here once before and had a decent time but this time it came as our nightmare. Everything was just so bad. I would give them minus stars for their service if there was an option for that. Pricey for no damn reason, ill mannered staff, bad DJ and on top of that bad food. I wouldn't go there again and wouldn't suggest anyone as well."]}}